[
  {
    "title": "\"Great Support & great tool!\"",
    "description": "What do you like best about Close?I have been using Close for about 10 months now in Sales. Like any software in the world, issues can arise, but what I can say is that the level of support has been excellent in such situations! \n\n- The in-tool reporting is smooth & immediate,\n- I always got fast answers by email and direct contact with the support team,\n- Additionally, my company also has an account manager at Close, in case of bigger issues/escalations. \n> At all times, we know we won't be left hanging which is very reassuring. \n\nAll of the above is also complemented by banners effectively visible on the software itself, whenever an issue is more globalised and worked on - here again, communication is key and if we know, it is already reassuring to read they're on it! What do you dislike about Close?More visibility on the leads from the tasks pannel, directly from the inbox, would an amazing improvement. Even better if it allows us to filter/order, so we can give priority to some tasks over others without having to enter the lead itself. What problems is Close solving and how is that benefiting you?As per the previous summary, the level of support has been key. ",
    "date": "2025-01-07T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Yann L."
  },
  {
    "title": "\"Best CRM on the market\"",
    "description": "What do you like best about Close?I Record/Produce music. Close has been a game changer in that I can easily keep track of all of my conversations with literally hundreds of potential clients and automate reminders to follow up with them ensuring that I stay top of mind. Freeing up my brain and easing my anxiety so that I can focus on being creative. I use it literally every day.\n\nClients are astonished when I remember their birthdays, family members, and all of the details about projects that they themselves forgot about. \n\nThe GUI is incredibly intuitive and the workflow of it, IMHO, is far superior to any other CRMs. Even ones at much higher price points. I am a small business and the price/features of Close give me the exact tools I need without paying an arm and a leg for more expensive CRMs that give me a ton of features I will never need. It's the perfect balance of a CRM  with incredible customer support as well. \n\nClose has easily helped me double my income since I implemented it. It's one of those things where I have no idea how I used to live without. What do you dislike about Close?I tried to think really hard, but I honestly don't have any complaints about Close. They continue to do updates and bug fixes and their customer support is alway quick, friendly and any issues I have are quickly solved. What problems is Close solving and how is that benefiting you?Close allows me to stay top of mind with potential clients, which has more than doubled my income. It frees my brain and eases my anxiety by automating reminders and keeping track of conversations all in one convenient place, with zero effort in trying to navigate the GUI. ",
    "date": "2025-01-16T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Neil Engle M."
  },
  {
    "title": "\"A Great CRM!\"",
    "description": "What do you like best about Close?Close is my favorite CRM. I've been in sales for many years, and I've used everything, but Close is the best. It's easy to use, I love the powerdialer (great if you have a lot of leads you need to reach!), I love how easy it is to input notes, how organized it is and I love how easy it is to make customized lists to better organize cilents. What do you dislike about Close?Sometimes it's tricky to merge leads, for whatever reason our leads sometimes come in twice (they might have booked months ago and again more recently) and it could be nice if merging them didn't delete everything from one (it's easy to accidentally delete the wrong one, too). That isn't really a big issue, though, I'm just nit-picking because Close is great. What problems is Close solving and how is that benefiting you?Close solves time management issues, especially with outbound sales. It's quite easy to call multiple people in a short time and track at the same time. Close has helped me better understand where prospects are in the pipeline, and I love that each company can customize what their own pipeline looks like. Everything is in one place, emails, SMS, bookings. It's easy to see exactly what has happened with each client individually, too. ",
    "date": "2025-01-08T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Kristin H."
  },
  {
    "title": "\"The best sales CRM we've ever used\"",
    "description": "What do you like best about Close?When it comes to a CRM that helps you manage the sales cycle as a small or medium-sized business, I've not encountered a better system out there. We've tried scores of them over the years including Salesforce (which was massive overkill for what we needed). \n\nWhat we've liked best about Close is that it knows what it is and what it is not. We've been on the platform for over 7 years and have worked with them through many iterations of the software and every feature release has been intentional and valuable for our team. \n\nIt integrates seemlessly with our email (Google Enterprise) and we've been able to use their API to integrate with all other platforms necessary along the way. It has extremely powerful reporting, workflows, smart views, task management, pipeline management and more. It's very easy to train new team members how to use it and it gives a magnificent timeline of clients and their interactions with our team.\n\nThe Smart Views are probably one of the most valuable features we use with the system as they allow us to ensure that no lead or opportunities get left behind and it makes it easy for sales managers to quickly identify who on the team is behind on their client or prospect communications or follow ups.\n\nThe integrated dialer and phone system along with call recording and AI summaries cuts down on the need for the reps to take detailed notes and allows them to more quickly move on to more dollar productive activities.\n\nTheir recent mobile app release was something we had been asking for for years and it was a very welcomed addition to the tool as we have a remote sales force. \n\nLastly, it's very fast to use. Salesforce (and many others) require too many steps to perform basic activities and the platforms can be slow to load and work in. Close is FAST. Everything is easy to get to and things just load quickly. Our team loves that aspect of it. What do you dislike about Close?Because Close is a sales CRM, you will need separate systems for marketing and fulfillment which means that you will need to have someone on the team versed in systems integrations and who can help maintain clean data between all of your systems. This has gotten so much easier with Close than when we first started with the platform. We had to do a lot of data clean up at times while we figured out how to best manage the synchronization between the different systems.\n\nIf you know this going into it, you can prepare in advance to make sure that you've thought through the different triggers in each system that need to fire off updates into Close and from Close into those systems. A great example is when a client's information is updated in a fulfillment system or a marketing system, you need to ensure that Close gets the update rather than a duplicate record getting created or it not getting updated at all.\n\nThis also means you need to figure out what information your sales team needs to know about your product or service delivery and make sure that information is fed back into Close so that you don't have information silos that keep sales people in the dark. Again, this can all be managed with proper planning but you need to be aware of it.\n\nThe one other thing that took us some time to figure out initially is the way the structure the system around Leads and Contacts. We are more of a B2C operation so the Lead is typically the Contact (but not always). So this created some issues at first because Leads have a one-to-many relationship with Contacts. Meaning, they assumption is that the Lead is a company and the Contacts are those contacts at the Company (Lead) that you interface with. Not the end of the world but certainly something you need to account for if you're working with B2C and B2B like we sometimes do. What problems is Close solving and how is that benefiting you?It's our Sales CRM and it's been the backbone of our sales operation for years. It's made it so much easier to train and onboard sales people, keep everyone updated on the status of deals, manage our sales teams activity, and ensure that our pipeline is clean and well managed. ",
    "date": "2025-01-06T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Travis R."
  },
  {
    "title": "\"Transitioning from HubSpot to Close\"",
    "description": "What do you like best about Close?We’ve been using Close.com for a over one year now, and overall, it’s been a very solid CRM for managing our sales pipeline. The setup was relatively straightforward, and the interface is user-friendly, which made onboarding our team easier than expected.\n\nOne thing we really appreciate is the integrated email and call tracking—it saves time and keeps everything in one place. Close has definitely helped us stay organized and focused on follow-ups, which has been a game-changer for our sales process. If you’re looking for a CRM that emphasizes simplicity and productivity, it’s worth considering. What do you dislike about Close?The Workflow feature is currently a bit limited overall compared to HubSpot or other CRMs. What problems is Close solving and how is that benefiting you?Simple to use but still customizable, AI features are great and overall really good to use and focus on actually making calls instead of (like HubSpot) way to much time spent on keeping records up to date. ",
    "date": "2025-01-07T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Nils K."
  },
  {
    "title": "\"One of the best CRMs for start-ups\"",
    "description": "What do you like best about Close?I have been using Close from quite sometime now. The features that I love is the flexibility on how I could set up and manage my leads. \nThe notifications of opportunities and tasks are seamless and they appear in a way I don't get overwhelmed if I am doing some different task.\nThe email & SMS configuration along with custom templates is amazing.\nThe software itself weather on mobile device or my work pc is pretty easy to use.\nAdministative reporting is a plus with a little bit of flexibility there too. What do you dislike about Close?Sometimes it acts slow or acts like it's lagging or something usually have to refresh the page to get it to work properly again but this happens rarely. What problems is Close solving and how is that benefiting you?Helping us Account Exectives & Customer Success Managers increase customer engagement getting complete overview of past communications. sending automated bulk emails or even single emails right when I am at a lead. I could just choose from the templates and get it sorted. It saves a lot of time by these very needy small features. ",
    "date": "2024-12-23T00:00:00.000Z",
    "rating": 4,
    "reviewerName": "Dawood N."
  },
  {
    "title": "\"Close bietet alles, was wir für effizienten Vertrieb benötigen\"",
    "description": "What do you like best about Close?Effiziente und zeitsparende Wege, um unseren Vertrieb maximal zu skalieren. Der Kundensupport reagiert stets schnell. Wir verwenden Close täglich, um den Erfolg unseres Vertriebes zu maximieren. Die Verwendung von Close ist sehr benutzerfreundlich und einfach in der Anwendung. Außerdem lassen sich andere Tools, wie bspw. Calendly über Zapier oder Make gut verbinden und automatisieren. Generell ist Close einfach in der Umsetzung. What do you dislike about Close?Es fällt mir schwer, negative Punkte zu finden, da ich bisher mit allem in Close zufrieden bin What problems is Close solving and how is that benefiting you?Unsere Anforderung an Close war, dass wir mit Hilfe einer einfachen Bedienung und effizienten Oberfläche viele Kundenkontakte in kurzer Zeit aufnehmen können, um so in derselben Zeit eine höhere Effizient zu erhalten. All diese Punkte trafen voll und ganz auf Close zu. Nachdem wir bereits zuvor mehrere CRM-Programme getestet hatten, entschieden wir uns klar für Close, da dieses Programm unsere Anforderungen als bestes abdecken konnte. ",
    "date": "2024-12-27T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Aurora C."
  },
  {
    "title": "\"Real Estate Investing CRM\"",
    "description": "What do you like best about Close?Close was the preferred CRM at the company I worked for years ago. When I decided to start my own firm, I knew that the Close System was my first investment. This system is easy to use and has plenty of features. You can tailor the system to work for your team. The app has been a great addition in the last few years and makes working each day much easier. Never miss a deal with this software! What do you dislike about Close?I have not had any issues with close that they were not able to address with customer support. Keep up the good work Close! What problems is Close solving and how is that benefiting you?Close has allowed my small startup to get off the ground in a cost effective manner. I am able to pay monthly and upgrade at anytime. I use the software to keep track of my leads and use the VOIP services. ",
    "date": "2024-12-17T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Summer Birds C."
  },
  {
    "title": "\"Close is great\"",
    "description": "What do you like best about Close?It allows me to have one place where I come to and see the progress of my leads, who I need to contact and reminds me of where I got to with them.\n\nIt's amazing to know exactly your last point of contact all in one place, this means you can follow up my personally and efficiently. Saves time and makes money! I use this daily now. \n\nThe customer support is great. I can reach out about a problem and get a non AI response rapidly, it's amazing. Super easy to integrate across to and get started as well. What do you dislike about Close?There's not much I dislike about close to be honest. I couldn't really tell you anything. What problems is Close solving and how is that benefiting you?It solves the problem of being able to track the last time I spoke to a lead, their response and any notes all in one place. ",
    "date": "2024-12-11T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Adam T."
  },
  {
    "title": "\"Great Experience Overall\"",
    "description": "What do you like best about Close?What I like about close is it's not clunky. Very user friendly but the biggest perk for me is the call recording and call summary. If I want to go look back at a prospects file. Super quick and easy and I'm ready to hop on a call like I have a super sharp memory. What do you dislike about Close?I guess that the app times out every once in a while I will have to refresh the app but honestly it's not a big deal. So adding one more thing because first really isn't a thing. Sometimes when I talk calls on my phone the call isn't recorded. Not sure about that only happened twice. What problems is Close solving and how is that benefiting you?All customer data in one place easy to use and simplified extraction of info. ",
    "date": "2025-01-05T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Brandon  C."
  },
  {
    "title": "\"Close is GREAT!\"",
    "description": "What do you like best about Close?I use CLOSE every day and I love how simple it is to use. The onboarding tutorials are fantastic in helping get you up and running quickly and easily. When I reached out to support they responded immediately and even outside of business hours which was nice for me.  Definitely would reccomend! What do you dislike about Close?One thing I would add is the abiltiy to enter descriptions when creating a task. It's not hard to figure out what you need to do once you go into the contact or lead but adding a description would make it easy to identify it at a glance. What problems is Close solving and how is that benefiting you?Close helps organize what I need to do each day, and automate some tasks with the use of workflows, saving me a lot of time. ",
    "date": "2025-01-03T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Louis O."
  },
  {
    "title": "\"Easy to use but super capable sales-tool\"",
    "description": "What do you like best about Close?Compared to (in my oppinion) cluttered CRMs like Pipedrive, Close is super user friendly. What i like the most is the beautiful ui, which is much more streamlined than most of the competition. Using close therefore is fun. When i ecountered problems, the mail-support  was quick in helping me. \n\nAnother great advantage: the api is really good, via zapier we can connect and automate other software like Clickup, Perspective Funnels etc. best thing about it: the integrated mails. In close i got more overview regarding mails than in my mail app.\n\nLastly, integrated calling is nice to have. For me its not the biggest part of my job but beeing able to call from within close from time to time without the need to take out my phone and dial numbers is great!\n\nSetting up close was pretty easy, the guide helped a lot. \n\nAll in all is clsoe my buddy throughout the day, love to use it. What do you dislike about Close?At first, the price tag seemed pretty high. But considering the calue, close delivers, im ok with that after all. \n\nI Would have wished for maybe a call to set up everything, getting some tips and best pracises.\n\nMaybe an integrated  AI, trained specially for cold mails would be great, i am using Chat GPT for that part. The integrated AI is okay, but not as capable as for example Chat GPT. What problems is Close solving and how is that benefiting you?Keeping track of our current opportunities; automating our mail marketing; being able to work together on leads ",
    "date": "2024-11-13T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Martin P."
  },
  {
    "title": "\"Essential CRM for Automated Sales Processes\"",
    "description": "What do you like best about Close?What I appreciate most about Close is its excellent integration capabilities and the robust automation features it offers. It allows for seamless connections with other tools, which is ideal for creating complex, assembly-line-style workflows. Whether it’s capturing, nurturing, or following up with leads, Close adapts flexibly to our unique processes and helps us streamline our workflow to a level that few other CRMs can match. What do you dislike about Close?Initially, I found the user interface a bit challenging to navigate, especially for new users. Additionally, the platform is entirely in English with no options for other language translations, which could be a barrier for non-English-speaking teams. What problems is Close solving and how is that benefiting you?Close serves as a powerful foundation for our sales processes, particularly when combined with enrichment tools and invoicing/onboarding tools. From my own experience, Close has reduced the time required for our sales operations by as much as 70% compared to previous workflows. This increased efficiency has been a significant boost for our team's productivity and results. ",
    "date": "2024-11-08T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Roman L."
  },
  {
    "title": "\"Best CRM Software\"",
    "description": "What do you like best about Close?What I appreciate most about Close is its intuitive, user-friendly interface that streamlines the sales process. The built-in communication tools—such as calling, SMS, and email—integrated directly into the platform, allow for seamless interaction with leads and clients without the need to switch between multiple applications. Additionally, the automation features, like email sequences and follow-up reminders, significantly reduce manual tasks, enabling me to focus more on closing deals. The robust reporting and analytics tools provide valuable insights into sales performance, helping to identify areas for improvement and track progress effectively. What do you dislike about Close?While Close offers a robust set of features, there are a few areas that could be improved:\n\nPricing Structure: Some users find Close's pricing relatively high, especially for smaller businesses or startups. While it offers a robust feature set, the cost may be prohibitive for budget-conscious organizations. What problems is Close solving and how is that benefiting you?Close addresses several key challenges in sales management, providing significant benefits:\n-Automation of Repetitive Tasks: Features like email sequences and follow-up reminders automate routine tasks, reducing manual effort and allowing me to focus more on building relationships and closing deals.\n-Effective Lead Management: Close offers robust lead tracking and customizable pipelines, enabling me to prioritize high-value opportunities and manage the sales process more effectively. ",
    "date": "2024-11-05T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Damian G."
  },
  {
    "title": "\"For me, the best CRM on the market.\"",
    "description": "What do you like best about Close?Close is lean, like our business. Most CRMs are completely overloaded and do not focus on what really matters. We work with Close every day and in 2 different areas with the multi-organization license. Close is intuitive and offers EXACTLY THE FUNCTIONS that our team needs day by day. Our entire team (ex-Apple, ex-Mercedes) says there has never been a better CRM in any company.The updates are always on-point and the software receives new features almost monthly, which add even more value. Via Zapier, Close can be integrated into almost any setup excellently and that too without hardcoding! What do you dislike about Close?I can't say much about that. From time to time there are bugs, which the team resolves within a few days and ALWAYS takes seriously. I don't know if that's a disadvantage. In Germany we say: Where there is planing, shavings will fall! What problems is Close solving and how is that benefiting you?Pretty much every problem in the B2B sales process. We are a product company, and even here, Close can be applied excellently. Whether it's handovers between teams, documentation of offers, etc. Close is our all-in-one solution! ",
    "date": "2024-11-04T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Nico S."
  },
  {
    "title": "\"My favorite CRM\"",
    "description": "What do you like best about Close?The platform is highly intuitive and user-friendly, with straightforward CRM tasks that are easy to manage, the smart views are also very usefull.\n\nIt's particularly effective for outbound sales campaigns, especially for cold email outreach and cold calling.\n\nI appreciate the reports section, as it enables seamless comparison of statistics with my team, fostering better collaboration and performance insights.\n\nOverall, this is so far the best CRM I have ever worked with. What do you dislike about Close?Almost nothing so far except a few tiny bugs sometimes, but I'm happy with the software and what it offers. What problems is Close solving and how is that benefiting you?It streamlines my prospecting efforts by allowing me to quickly call leads and efficiently record valuable information to close deals more effectively. ",
    "date": "2025-01-09T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Alexis B."
  },
  {
    "title": "\"Easier power dialing\"",
    "description": "What do you like best about Close?Making the switch to Close has been such a game-changer for us. While we were using old CRM system (which I will not mention lol) power dialing felt like a full-time job in itself, and it wasted so much of our time. With Close, the whole process is way more streamlined and just makes sense for how we work.\n\nPlus, having transcripts built right in is a huge plus. Now we don’t have to mess around with other tools for notes, and it’s super easy to share all the call details with our closers. They go into meetings way better prepared with the info they need on each prospect, and it’s made everything run a lot smoother. Overall, Close has been a breath of fresh air for us! What do you dislike about Close?I don't really know if will be able to match the AI automations we had in our old CRM system, but who knows, I am not a tech guy What problems is Close solving and how is that benefiting you?Makes power dialing a lot easier and not so exhausting ",
    "date": "2024-10-25T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Gabriel A. V."
  },
  {
    "title": "\"Close CRM is the Real Deal!\"",
    "description": "What do you like best about Close?Close CRM is a simple but powerful platform that is easy to navigate. What I really like is the fact that you can segment your data based on a number of filters. I especially like that I can see who opened my emails so that I can prioritize my follow up with leads that are more likely to convert. What do you dislike about Close?There is not much that I don't like. I wish there was a native integration with data providers like Seamless.ai. What problems is Close solving and how is that benefiting you?Close allows me to sort through a large data set to find prospective clients in a systematic approach. I can tailor my message to the prospect based on the data in Close and automate my follow up. I'm saving so much time and it is much more efficient than other point solutions I've used in the past. In my opinion, Close is the best CRM on the market for this segment. ",
    "date": "2024-10-25T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Taylor R."
  },
  {
    "title": "\"Bringing Sales to the next Level\"",
    "description": "What do you like best about Close?Before we used close we had difficulties with managing all of our leads, we've lost a lot of potential because of that. After starting using Close and creating a great system, we are now at a super fast response rate and managing all our customers with ease. \nThe support is super helpful and also really fast. I love that you can call from the app directly and get a conclusion with the AI-Assistant. All in all it's a great app and I love using close since the first day. What do you dislike about Close?I would love to pin the most important information at the top of the lead activity. What problems is Close solving and how is that benefiting you?It helps us to manage hundreds of clients with a small team and be very fast all the time. Also we don't lose information because of calls which are not recorded. ",
    "date": "2024-11-18T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Jan v."
  },
  {
    "title": "\"Great CRM for a Small but Growing Company\"",
    "description": "What do you like best about Close?Nice interface, really customizable, easy to navigate and very user friendly once you know the ropes. An excellent customer support team. The initial setup was really simple, even though we were coming from an ancient Access database. And they are constantly taking feedback and creating new features and solutions. What do you dislike about Close?I wish there was an easier way to integrate to bill.com, which is what we use for invoicing. Also, a lot of our customers are on payment plans, and so far I haven't found a super easy way to track those through Close. What problems is Close solving and how is that benefiting you?Tracking the sales pipeline and making financial projects - not only does Close help us figure out what is coming in and what sales we could potentially be closing soon, it also helps us track what customers DIDN'T end up closing the sale and why. With all the customizable fields, Close makes tracking current and potential customers simple. ",
    "date": "2024-10-18T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Kathryn P."
  },
  {
    "title": "\"One of the best Sales CRM used\"",
    "description": "What do you like best about Close?Close is designed for sales people who are really reluctant to enter the details at the end of the day long work. This is designed perfectly to make the life of sales person very easy. Also the way we can set up the flow using the custom fields and work flows are really nice. The Close team responds to all your queries quickly What do you dislike about Close?These days in India, we are not able to use the calling feature. Also they should bring the user wise lead masking in the basic plan itself What problems is Close solving and how is that benefiting you?Close is helping me track all the tasks and gives me and my team a better view about all the activities happen in sales for each accounts ",
    "date": "2024-12-23T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Anand G."
  },
  {
    "title": "\"Fast&Cool + constantly updating\"",
    "description": "What do you like best about Close?I liked mostly that it's super efficient to respond to emails or find any leads - you can find by email address which makes the process during the call less stressful in the situations when you need to find something while on call with the client. Workflows work best for you when you are sharing a bit of time to configure it. Another good choice is that this guy's permanently some new offerings and collabs Calendly showed its benefits. A good process for sharing the tasks and splitting the roles. What do you dislike about Close?I've shared some of my ideas to make my workflow easier by adding some interface changes and implementing a like button for messages. But these updates have not been implemented yet. What problems is Close solving and how is that benefiting you?Replying by phone or email and sorting all leads by categories. ",
    "date": "2024-11-20T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Alex Z."
  },
  {
    "title": "\"User Friendly CRM\"",
    "description": "What do you like best about Close?I’ve used a lot of CRMs, but Close stands out as the best! The ability to forward calls directly to my cell phone is a game-changer, and the workflows are super easy to set up, implement, and monitor. I love being able to text straight from the app, and the automated dialer helps me get through calls quickly while still allowing me to pause or dial manually when needed. The integrated email feature ties everything together seamlessly, making it easy to manage all my communications in one place. Highly recommend Close for anyone looking for an efficient, all-in-one CRM solution! What do you dislike about Close?I would like more freedom to alter the automation function of the work flows, but it still works nicely as is. What problems is Close solving and how is that benefiting you?contacting mass potential clients ",
    "date": "2024-12-03T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Joseph T."
  },
  {
    "title": "\"The change over of CRM's to Close was a huge game changer, not on for myself but also for our team.\"",
    "description": "What do you like best about Close?There are many features I like about Close, from the responsive customer support chat bot to the quality of the calls. If I had to pick I would say the predictive dialling as it makes the job a whole lot easyer as well as the notes created automatically after a call has been completed. Amazing features! What do you dislike about Close?The inability to receive calls on two devices at the same time ie, cell phone and laptop at the same time. I believe this is key in order to stay 100% active and not miss any calls, I belive this would help increase answer rate. What problems is Close solving and how is that benefiting you?The ease of making calls via using the predictive dialling. A lot of notes would previously lost, but the Close history system is phenomenal and has really helped record all neccessary information. ",
    "date": "2024-10-30T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Garron W."
  },
  {
    "title": "\"Works great for Sales and Marketing Department!\"",
    "description": "What do you like best about Close?I work in the Sales department of a small company and we use Close every day to keep track of all our customers, it has been SO helpful. It is not only great to create channels to follow up with customers, emails, and calls easily but it also allows you to quickly visualize your forecast revenue, as a salesperson, I truly appreciate this.\nAlso, has a great tool called \"workflows\" You can automate so many things there for faster communications, and our Marketing team is so happy with this.\nRecords your calls, so you can check back later if you need to, we also have some integrations built to fit with our current processes, it was not a pain for our Operations team to build them, and finally, you can jump into group Zoom calls to express your needs and their Support team will help you find a good way to deal with your pain. What do you dislike about Close?The only thing I could add here is that the implementation was not fast, it took us several months (4-5 to be exact) to reach the point where we are now What problems is Close solving and how is that benefiting you?Thanks to the filters and smart views has made my follow up process way simpler, saving many hours a week and avoiding missing customers interactions ",
    "date": "2024-10-07T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Michelle I."
  },
  {
    "title": "\"Efficient and Intuitive\"",
    "description": "What do you like best about Close?I have used several CRM's in the past, but this one is the most intuitive and easy to use.  Calling and emailing from a contact is perfectly done.  It's easy to use and I find myself barely using any support resources.  I am a heavy user and I able to keep track of my clients and opporunties.  Adding contacts via CSV is really intuitive and seamless process. What do you dislike about Close?The only thing I think would I would improve is allowing the individually select contacts from a smart view to send a bulk email.   As of this moment, i haven't figured that one out! What problems is Close solving and how is that benefiting you?It's making my time more efficient, so I can do more functions like increase my outbound outreach ",
    "date": "2024-12-10T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Anthony P."
  },
  {
    "title": "\"The CRM that Sales People Actually Like Using\"",
    "description": "What do you like best about Close?As an Account Executive, my job is new business. And for this, Close is by far the best CRM. It has an easy and intuitive feel which allows me to be able to get to clients faster. My favorite thing is the all-in-one view that Close provides of the entire history of the communication with a prospective company (all emails, text, phone calls in one place). Not to mention the beautiful IU design and the iPhone app is great as well (I can access my data at any time). Customer support is extreamly helpful and pretty quick (1 - 2 business days usually). I use Close every day of the week (& weekends too sometimes). It's my main tool for sales. What do you dislike about Close?Just to give context to this section: I made my lastest company switch to Close because I hate Hubspot (for outreach & new business, it's good for other things). Close is the best CRM for new business don't let anyone tell you otherwise.\n\nI wish they had phone based customer service ! Even if we need to pay extra, sometimes it's easier to solve things with a quick phone call. The integration with Hubspot is very good, but not perfect (this may just be my own personal experience), so I wish that was better of course. What problems is Close solving and how is that benefiting you?AI transcripting saves time\nClear picture of the history of a prospective company\nI get to spend more time calling & obtaining new business and less time wasted on sluggish CRMs ",
    "date": "2024-09-20T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Lloyd M."
  },
  {
    "title": "\"Wonderful, easy to use CRM\"",
    "description": "What do you like best about Close?I love how easy it is to use Close. I had never used it before my current role and it has been very simple to learn. I also find that the power dialer is very effective and allows me to increase my call volume and connect rate. Overall, I really like using Close and would gladly recommend it to other salespeople. What do you dislike about Close?I have found it's not as easy to create templated emails as I would like, and it's harder to include attachments in emails. What problems is Close solving and how is that benefiting you?It is helping me stay on top of my tasks, which allows me to be more efficient. The auto dialer also allows me to call more people than I normally would be able to, and improve my connection rate. This has allowed me to have more at-bats and close more deals. ",
    "date": "2024-11-04T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Brianna G."
  },
  {
    "title": "\"A great CRM that's super simple to use.\"",
    "description": "What do you like best about Close?This simpliticity. I use it everyday for 8+ hours, as a sales rep it's super easy to use since I'm not super techy. It integrates super well with my calendar and and any bookings are reflecting in the contact. The smart views is what I use most often and it's the best part as I have multiple with 110,000+ leads in some. Really great. And it has a predictive dialer with reduced ring time which is great and super helpful with what I do. What do you dislike about Close?You can't see the exact time someone texted or called if it's been longer than an hour. I may not be aware of this but from my knowledge you can't see that and it would be helpful. Especially with multiple texts and such. What problems is Close solving and how is that benefiting you?The company I work for has hundreds of sales reps and hundred of thousands of leads so it organizes it well and is easy use for all of us. The company is Committed coaches. (I couldn't fill it out with the email associated with close which is emmareinkecommittedcoaches@gmail.com. However I do use Close for my personal business as well which is under this email) ",
    "date": "2024-12-18T00:00:00.000Z",
    "rating": 4,
    "reviewerName": "Emma R."
  },
  {
    "title": "\"Account Exec\"",
    "description": "What do you like best about Close?I've been using Close.io for over 4 years now and I love it's simplicty. Best CRM for sales and pipeline management. Easy to use and the quick resposne from the their support team is invaluable What do you dislike about Close?I'm not a fan of the smartview folders and the filters available when I'm trying to segment data. I would love to see smartview folders similar to a zip folder. The issue is that I have 20 smartview folders for 20 different items when it'd be helpful to catorgoize sub folders within a single one.\n\nThis will help reduce chaos along the left side of my screen and other users that share the database. What problems is Close solving and how is that benefiting you?Chaos Management. \n\nI'm at peace knowing I can go on PTO for 2 weeks and come back to a poluted inbox that's easy to handle. ",
    "date": "2024-11-04T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Adib (AJ) A."
  },
  {
    "title": "\"Incredible Sales CRM\"",
    "description": "What do you like best about Close?The flexibility to customize leads and the integration of all unique lead communication in one place (i.e. emails, calls, notes, files, etc.). Incredibly helpful sales platform that really helps organize and document relationship history. Truly love this platform and makes my job so much easier! What do you dislike about Close?The only issue I have experienced has been issues with call quality, where there has been static on the receiving end of the line. Mobile app interface also doesn't refresh very frequently and need to backout to update. What problems is Close solving and how is that benefiting you?Close is the heart of our sales organization, helping us stay organized with leads and track our pipeline. It's the ultimate organization and documentation nucleus. ",
    "date": "2024-12-26T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Will R."
  },
  {
    "title": "\"The first intuitive CRM system I like to work with!\"",
    "description": "What do you like best about Close?Email, sms, calls, meetings are all integrated and the full history of communication is shown in one clear screen. I love the workflows you can set up and enroll prospects in with email templates and activities. Search function is bringing you where you need to go fast and pipeline, reports and smartviews are very helpfull. Most of all it all makes sense from minute one and you don't need days of training or hours of research to get used to the system. What do you dislike about Close?Adding a phonenumber is costly if you need a Dutch number What problems is Close solving and how is that benefiting you?Tracking of oppertunity status and communication. Automated mail campaigns and more it saves me a great deal of time so I can focus more on other sales activities and get more done. ",
    "date": "2024-11-19T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Allard  S."
  },
  {
    "title": "\"Its pretty good for me as an appointment setter makes everything easier but there are some issues\"",
    "description": "What do you like best about Close?i think the most helpful is that you could auto dial it makes it better and I like the recording call feature and the task feature to schedule calls and that im able to take notes while on calls with leads What do you dislike about Close?I dont like the auto dialer doesnt double dial and has some issues where calls randomly hang up sometimes or wont load the next leads as fast so its tough to reach out sometimes since I dont know who im adressing What problems is Close solving and how is that benefiting you?It helps with being more effeient and organized since it emails you as well and its pretty easy to use to get a hang of if your a newer user ",
    "date": "2024-12-14T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Marcelo F."
  },
  {
    "title": "\"Best CRM for High Ticket Selling\"",
    "description": "What do you like best about Close?Whether you're running a setter/closer model or just a sales model Close is pretty awesome. It's integration with Google and Linkedin + Calendly makes prospect recon easy and management sales calls clean. We've used other systems. Nothing compares. Including big ones like Salesforce. After spending over $10,000 on customizing salesforce, it still didn't cut it. \n\nWe get about 900 leads a month to go through. We were getting about 70% penetration as leads would fall through the cracks. \n\nNow, my team uses workflows and they can easily control their own leads and we get 100% penetration on all leads. As a manager, the reports show me exactly what I want to see without the bloat. I can listen to calls, see what's happening minute by minute. There's truly nothing like it.\n\nWe use it every day. And if we have a question, support is easy to get a hold of. My favorite part about support is the integrating screen recording so I can easily show what my question is and don't have to type a bunch of stuff up. \n\nWe had CLOSE set up 100% and ready to go within 2 weeks. \nThat's unheard of with a CRM! \n\n(And we had 25,000+ contacts to load in) What do you dislike about Close?Not much. The only thing missing would a general task tool where a TASK didn't have to be tied to a lead. Or even integration with Google Tasks would be fine. Other than that. That's it. What problems is Close solving and how is that benefiting you?The best CRM is the one you use. And my entire team uses it all day! And our database is clean! ",
    "date": "2024-12-12T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Jonathan H."
  },
  {
    "title": "\"The most intuitive CRM software I have ever tried\"",
    "description": "What do you like best about Close?Intuitive, user friendly, great support staff that are quick to respond and professional. Very organized and clean looking. Is extremely helpful for if you're trying to keep track of all the leads you're contacting and remembering to follow up on. Much more efficient than trying to keep them all in your head or on paper. Was also very simple to upload my lead list from Excel into Close. It is one of the  software programs I use most often for my business. \nI have worked in tech sales prior to starting my own company for which I am needing this software. I have used a few different CRMs during my sales career and some are extremely cluttered and old school. Out of all of them, Close is my personal favourite. What do you dislike about Close?Honestly I can't think of anything. Maybe the pricing is a little high for someone who is starting their business and trying to keep costs low, however it is well worth it and on par with other CRM pricing. I also have had experience using other CRM software so it was quite easy for me to pick up on how to use Close. Maybe people who are new to CRMs might find it a little more challenging, however out of all the ones available on the market, Close will still be their best bet for something that is user friendly and uncomplicated to learn. What problems is Close solving and how is that benefiting you?Increases efficinecy substancially. Ensures that you keep track of all your leads and communications/follow ups. ",
    "date": "2024-12-12T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Verified User in DesignInformation"
  },
  {
    "title": "\"95% happy, but there's always little things to improve.\"",
    "description": "What do you like best about Close?Very intuitive and easy to navigate - simple CRM tasks are clear.\n\nGreat to do sales outbound campaigns, especially as we do mostly cold emails.\n\nCustomer support is so good. Like really good.\n\nLoom videos, good instructions and such good advice.\n\nSupport is the best part about close by far. What do you dislike about Close?Reporting functions could be better, especially as they only show sequence stats after they're completed (as opposed to live).\n\nThis is probably the most important thing as I am not data driven, making the data super easy would make me a better salesperson.\n\nWill also send this to my partnerships lead as he's good a lot of feedback. What problems is Close solving and how is that benefiting you?Following up email sales - we primarily do email sales which makes close the perfect platform.\n\nTask management.\n\nNote taking. Id love if I could link notes to contacts though, because sometimes we take notes but there's no link to a contact. ",
    "date": "2024-12-11T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Verified User in Computer SoftwareInformation"
  },
  {
    "title": "\"4 years at Close - started as \"very impressively smart helpful\" and it keeps getting better\"",
    "description": "What do you like best about Close?Close is very impressive as it's..\nvery sleek, clean and chic yet\nsuper well organized, with endless options which you never notice until you need it and its very nature helps you keep organized and moving forward.\n\nYou can get started in seconds and you'll know what you're doing without thinking about it. It has great tools for sending emails, keeping on top of clients, handling all parts of the sales process with just very well thought-out and pleasantly attractive set up of the whole thing\n\nBest part is - amazing CS. Can email them direct from the CRM and get a response very quick. And they keep making it better. Many things you point out to them - you suddenly find have appeared in the CRM and many more that you didn''t.... What do you dislike about Close?only tiny gripe is that Inbox doesn't refresh itself or notify you when new email comes in so I have to keep using my Microsoft Inbox open the whole time when I'd love to just leave it and live in Close What problems is Close solving and how is that benefiting you?helps me not lose a drop of what I've done or have to do... even though I can be a sloppy mess sometimes. ",
    "date": "2024-12-10T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Verified User in Logistics and Supply ChainInformation"
  },
  {
    "title": "\"Übersichtliches Tool für JEDE Firma!\"",
    "description": "What do you like best about Close?Wir arbeiten jetzt schon seit ein paar Jahren mit Close zusammen. Ich bin sehr begeistert von der Vielfältigkeit und Überichtlichkeit des Tool. Es erleichert uns die Arbeit und unterstützt uns den Duchblick zu behalten und die Struktur zu wahren. What do you dislike about Close?Ich habe nichts zu bemängeln. Es funktioniert alles wie gewünscht. What problems is Close solving and how is that benefiting you?Meist haben Firmen keinen richtigen Überblick was Bespielsweise das Closing, die Follow Ups, die Terminprotokolle ect. angeht. \nClose hilft uns dabei unsere Struktur zu wahren und einen Überblick zu schaffen. Es erleichert mir im Vertrieb die Terminnachbereitung und die notwendigen Informationen am richtigen Ort abzulegen. ",
    "date": "2025-01-17T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Sarah S."
  },
  {
    "title": "\"Best CRM I've used in my 10 year sales career\"",
    "description": "What do you like best about Close?Close is the most effective tool I've used for contacting leads as soon as they come into our crm, staying on top of them as well with multiple touch points and then efficiently being organized to help with follow up.\n\nIt is also very good at tracking data to see what my team is doing on a day to day basis and also how we can better optimize our outreach.\n\nTheir support is also amazing and has helped me resolved anything I need in a timely manner.\n\nThey also have a feature where it's incredibly easy to find every conversation anyone in the organization has had. As a manager I use this everyday. What do you dislike about Close?Needs a better power dialer and a better reporting for organizing data on leads when it comes to dials and conversations for specific leads What problems is Close solving and how is that benefiting you?They are building out a better system for organizing leads to better suite my company's needs and also helping me be more organized with delegating certain leads to certain sales reps as my team expands ",
    "date": "2024-09-25T00:00:00.000Z",
    "rating": 4,
    "reviewerName": "Matt M."
  },
  {
    "title": "\"Keeps You Organized and Efficient\"",
    "description": "What do you like best about Close?All you leads in one space. Allows you to pull client data and call, email, text, communicate! \nAutomatically prompts  various follow up fields and allows you to set your own as well. Once logged in you cal also search follow up by various fields, ex: you can set to \"email\" and it will show any emails you have not responded to What do you dislike about Close?Making outbound  calls while in Ap, I don't use this as I tend to call from another area but I do use a lot for direct email and it's great What problems is Close solving and how is that benefiting you?Keeps client follow up in front of me. ",
    "date": "2025-01-05T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Alan H."
  },
  {
    "title": "\"Clean, easy and robust\"",
    "description": "What do you like best about Close?Everything is centralized throught the Inbox.  You can see emails received, SMS messages and tasks all in one place.  I also like you can customize almost everything: drip campaigns, activities and some automations.  As an investor, I have some custom fields that are important to my business such as Current Value, After Repair Value, zillow link, timeframe to close, mortgage balance, interest rate, liens/judgements and other fields.  I can create a standarized \"Activity\" box, so when I'm on calls with clients (which you can do through the app and have it recorded), you can click on Custom Activity =>  RE Discovery and all my fields pop up. \n\nRecorded phone conversaitons are great too.  I enjoy the ability to have phone conversations through the app and have it saved as a recording.  Last items I enjoy, as I scale and add members, it looks easy to assign tasks and different levels of access.\n\nThe data analysis/searching is wonderful.  I can search and create filters of searches on just about anything I want.  I can search by the date a contact was created, I can search by home price, date of sale, projected profit, etc... It's almost unlimited.\n\nLastly - it's nice to see a kanban outline as well as line view of clients and tasks.  Overall, Close is an easy to use CRM that is simple in U.I, but has robust features and customizations under the hood.  Very nice product. What do you dislike about Close?I wish there were some discounts for expanding.  There are other CRM's in my space that offer discounts as you add members, and as far as I know, if I have 3-4 members on the middle tier, it's the same $/month/user.  I also wish for drip campaigns, there was the ability to have an SMS or email go out within the first 2-3 minutes.  Close only allows automation by the hour.  Other than that, I can't think of any other issues/complaints. What problems is Close solving and how is that benefiting you?Close helps with organizing new and existing clients with a sales process.  I can see which clients have not been contacted, which clients have opened emails, which clients are a warm, cold or hot follow-up.  I can see who has a contract out and who is closed as well as projected profit.  Everything is in one place with drip campaigns of SMS and email. ",
    "date": "2024-09-20T00:00:00.000Z",
    "rating": 4,
    "reviewerName": "Joel G."
  },
  {
    "title": "\"Close has replaced Highlevel as my favorite CRM.\"",
    "description": "What do you like best about Close?The dialer in close is one of the best I've ever used. I've been in sales since 2016 and i've used a ton of different CRMs and dialers. I also love that support helps with A2p registration. What do you dislike about Close?The one thing that I dislike the most is the lack of warm transfer for calls. I run a call center and warm live transfer are a huge part of my promise to clients. What problems is Close solving and how is that benefiting you?My biggest issue was finding a system that could do multi line dials as well as SMS/email marketing. Close does all of these very well. ",
    "date": "2025-01-07T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Brodderick P."
  },
  {
    "title": "\"The best option for my startup\"",
    "description": "What do you like best about Close?Huge amounts of upsides. Super cost-effective, flexible, plenty of capability even on the cheaper packages, VERY easy to use and intuitive, and the SmartViews are great. Very simple to implement, train new users and import leads. CS team get back extremely fast. What do you dislike about Close?There isn't much to dislike. There's a few feature requests I've shared with the team, mainly around fleshing out the workflows and automations. I'm looking forward to seeing upcoming releases! What problems is Close solving and how is that benefiting you?We needed a cost-effective but capable CRM. We have many leads and contacts from a large TAM, so needed a CRM to help with organising, tracking, and staying on top of everything within the entire sales process. Starting with a very small team, the time saved with having everything I need in one place has allowed us to move far quicker and keep the team lean, with the compounding effect on saving $$$ on hiring. ",
    "date": "2024-09-23T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Harry C."
  },
  {
    "title": "\"I am new to sales - I just graduated college.\"",
    "description": "What do you like best about Close?Great interface that facilitates my work. I have no other experience with other software, but I really like using Close and i think it is a great program.\n\nThe AI summarization is also extremely helpful - it is better than I thought it would be. What do you dislike about Close?Texting comes across as green text. If there was a way to get close to work with iMessage, it would set this software apart from all others.\n\nI have a grammarly account - if that could be linked to close whilst I send emails that would be stellar.\n\nMaybe if you could get AI to help craft emails and how to phrase things internally that could be helpful What problems is Close solving and how is that benefiting you?It consildates lists of property owners in new york that I contact and it files all of their information in a digestable and condusive manner. ",
    "date": "2024-10-11T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Ethan S."
  },
  {
    "title": "\"Smooth, clean to use, easy and nice to work with.\"",
    "description": "What do you like best about Close?Close is a very good CRM it has great features and it is very simple to work with the automations and email systems are just perfect. I really like the power dialer it makes work smooth and easy. What do you dislike about Close?I experienced some technical issues with close here and there and it needs to be a little bit more reliable sometimes. Other than that I am happy with close and I would recommend it to every sales team out there What problems is Close solving and how is that benefiting you?Close is Solving our problem with being a CRM that has great features, is reliable, and great to use when having a Sales Team with tracking stats having a great overview over leads sales pipeline etc. ",
    "date": "2024-11-26T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Janne S."
  },
  {
    "title": "\"Amazing system for client management\"",
    "description": "What do you like best about Close?As a leader in customer success, I've had the opportunity to work with various CRM platforms, and Close stands out for its efficiency and versatility. The platform excels at bringing together client data, calls, and SMS, making it an all-in-one solution for sales and communication management. The platform is really clean and organized, it ensures that you spend more time engaging with clients rather than learning the system. Tracking client interactions, from emails to calls, is seamless, and the detailed contact history helps ensure no information gets lost. It’s easy to filter leads, add notes, and keep the entire team on the same page. I usually know who to call, when to call and what to say thanks to Close. This app is ideal for teams who want an integrated solution that combines client data, calls, and SMS into one accessible platform. What do you dislike about Close?Nothing so far and to be completely honest I'm happy with the software and what it offers What problems is Close solving and how is that benefiting you?It is helping me keep track of the clients, the back-and-forth communications and improve our workflows. ",
    "date": "2024-09-10T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Alexis C."
  },
  {
    "title": "\"The cleanest and best software I have ever used.\"",
    "description": "What do you like best about Close?It is the best software I have ever used. It is clean, fast, effecient, easy to use, and helps you keep track of every single lead you have. There are no more excuses for not following up with leads, because Close makes it impossible to not track your leads. The powerdialer is amazing, and the customer support is insanely quick and super helpful. After this I will never want to switch to another Sales CRM. \n\nIt is insanely easy to use after watching a few quick tutorials, integrating leads is very quick and seamless, and I use this software literally every day to run my business. What do you dislike about Close?The calling costs are a bit high for me, but I also do many calls and I know the costs are similar to other softwares. What problems is Close solving and how is that benefiting you?It helps me make a great amount of calls in short periods of time, always keep track of every lead and know what stage they are in to always know what to do when reaching out, and it's just very efficient in general. ",
    "date": "2024-09-06T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Cris M."
  },
  {
    "title": "\"Feedback about Close as a developer\"",
    "description": "What do you like best about Close?I have been using Close for almost 3 years. There are plenty of features that is worth to list but I am amazed how quickly they respond to completely new concepts in the world such as AI, voice transcription etc. They integrate every new technology that are compatable with the crm contexts. And I bet it keeps them in the top of the competition. Their customer support has been great since I started to work wtih them, and they help us to easily implement every new feature we want to. Here is a few of the \"bests\" I want to list.\n-Robust\n-Quick customer service\n-easy to use\n-never disconnected in working hours\n-great API doc\n-API endpoints work perfectly What do you dislike about Close?I could not think about a single thing I dislike in that system. What problems is Close solving and how is that benefiting you?It allows us to get contacted with 1000s of customers via email, phone, text. It allows to assign tasks to the users, track how effectively they call and speak with the customers. ",
    "date": "2024-09-05T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Ashot V."
  },
  {
    "title": "\"My Experience with Close CRM\"",
    "description": "What do you like best about Close?I like Close because it helps me manage all our clients very efficiently, allowing us to share the client database among team members and display all operations performed on a particular lead.\nIt is transparent, and all the emails in the inbox are shared with the team, which is essential for maintaining transparency within the team. We can also call clients directly using their stored phone numbers.\nClose can be integrated with other software according to our needs and demands using its API key. It also offers very handy features such as custom fields, pipelines, and custom activities. What do you dislike about Close?I find that the import feature sometimes causes trouble because some fields are not assigned at the time of import. For example, unassigned columns need to be manually assigned. This can be done for CSV files with a small number of columns, but it becomes challenging when dealing with a large number of columns.\nAnother issue is that custom field IDs need to be changed every time you integrate Close with your software. These IDs vary with different Close account owners, which can complicate the integration process. What problems is Close solving and how is that benefiting you?Close is solving several problems for us by:\nCentralizing all lead details and operations in one application.\nProviding a shared platform for the entire organization.\nAllowing all team members to review and access information simultaneously.\n\nThese features benefit us by:\nImproving organization and efficiency in managing leads.\nEnhancing collaboration and transparency within the team.\nStreamlining our workflow by having all necessary information in one place.\nReducing miscommunication and ensuring everyone has access to up-to-date information. ",
    "date": "2024-09-05T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Vedant  T."
  },
  {
    "title": "\"An amazing CRM to enable sales\"",
    "description": "What do you like best about Close?The AI transcription and summary feature is a huge time saver. Not only does in ensure there is a note for every call made but ensures that all details are captured as sales reps often do not go deep enough when it comes to notes.\nI also love the inbox view. Being able to see tasks, emails, SMS and missed calls all in one spot is great for organizing your day and ensuring speed to lead. What do you dislike about Close?That often when purchasing new phone numbers the numbers are already labelled as spam. Also, the phone billing is not by the second and that it rounds up to the narest dollar. What problems is Close solving and how is that benefiting you?Removing wasted time from sales reps day. This allows my team to stay focused on what they do best and do less admin work. ",
    "date": "2024-10-11T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Grant W."
  }
]