[
  {
    "title": "Reliable and convenient tool for handling both personal and business transactions",
    "description": "Comments:PayPal has been a reliable and convenient tool for handling both personal and business transactions. While the fees can add up in some cases, its security features and ease of use make it a top choice for online payments.",
    "date": "2 months ago",
    "rating": 5,
    "pros": "Convenience and extensive acceptance. PayPal allows me to make purchases, send money, and receive payments quickly, both domestically and internationally. Its buyer and seller protection policies offer a sense of security, especially for online transactions. The platform’s integration with various websites and apps is seamless, making it easy to use almost anywhere.",
    "cons": "Fees associated with certain types of transactions, especially for currency conversion and receiving business payments. Additionally, the customer service experience can sometimes be slow or challenging to navigate if there are account or payment issues."
  },
  {
    "title": "Use paypal for an easy and effective payment solution!",
    "description": "Comments:Paypal makes making and recieving payments an absolute breeze, and its smart features make life so easy!",
    "date": "2 months ago\n  \n    New",
    "rating": 5,
    "pros": "Paypal offers a seamless and easy payment processing platform that helps life run more smoothly.",
    "cons": "I have had no issues with paypal in my time using it."
  },
  {
    "title": "Paypal's lack of transparency and efficient communication makes it a risky option as a financial provider.",
    "description": "Comments:Paypal places many barriers between the customer and vital information making my overall experience very frustrating. This is made even more inconvenient by the lack of online support making it difficult to reach the right people when a problem arises. Paypal has caused numerous disruptions in my financial well being due to these issues.",
    "date": "last month\n  \n    New",
    "rating": 2,
    "pros": "Paypal is widely accepted as a payment option for online transactions, making it a convenient payment option when shopping online.",
    "cons": "Lack of account transparency such as the ability to view declined transactions. Additionally, the lack of easily accessible online support like many other payment providers offer as their digital experience. There does not seem to be any explanation as to why users are unable to view declined transactions and where the charge is coming from. This is extremely inconvenient and is potentially a security risk as monitoring all transactions towards any funding account is essential for monitoring unusual activity."
  },
  {
    "title": "PayPal review",
    "description": "Comments:My experience with PayPal has been mostly positive. It’s convenient for online shopping, sending money, and receiving payments. The user interface is simple, and transactions are generally fast and secure, which I appreciate. However, the high fees, especially with currency conversion or business transactions, can be a downside. Additionally, the occasional hold on funds can be frustrating when I need quick access to money. Despite these issues, PayPal remains a reliable option for online payments.",
    "date": "3 months ago",
    "rating": 5,
    "pros": "PayPal is very user friendly. I like how PayPal makes online payments so simple and secure. It’s convenient for both personal transactions and business, with the ability to link bank accounts or cards and pay without exposing financial information. The buyer protection is a nice safety net too, and it integrates with tons of websites and apps.",
    "cons": "What I like least about PayPal is the high fees, especially when converting currencies or handling business transactions. It also holds funds sometimes for extended periods, which can be frustrating if you need quick access to your money."
  },
  {
    "title": "PayPal-Big things come in small packages.",
    "description": "Comments:My overall experience is quit good with PayPal. I've been using them for 20 years. They have been number one go to for sending and receiving money before Cashapp and Venmo were ever around. I still use PayPal for online sales and big transactions because to me they are the most reliable and easy to access past payments received and sent, very organized. One of my favorite things is being able to send professional invoices to clients.",
    "date": "3 weeks ago\n  \n    New",
    "rating": 4,
    "pros": "I like how PayPal creates an easy user experience.",
    "cons": "What I like least about PayPal is the high transaction fee and per transaction fee for sending and receiving."
  },
  {
    "title": "paypal ... good until it isnt",
    "description": "Comments:for the majority of the time i found it extremely effective in money management",
    "date": "4 weeks ago\n  \n    New",
    "rating": 5,
    "pros": "i liked the fact you can send invoices , send payments to visa direct or venmo and accept swipe paymemts as well",
    "cons": "the security is great however it lacks unatuomated overides from custmer service representatives and inforces verification protocols that cant be addressed by sparsly available cusotmer service"
  },
  {
    "title": "My review about PayPal and what I love about it",
    "description": "Comments:PayPal is really good and I can always use it to put my money on my HSBC debit card.",
    "date": "4 weeks ago\n  \n    New",
    "rating": 5,
    "pros": "PayPal is something you can use to withdraw your money into your bank. You can also use PayPal to buy stuff on eBay as well and you can also use PayPal to add money.",
    "cons": "It can sometimes give me errors and it logs me out automatically for no reason."
  },
  {
    "title": "Pay with PayPal...",
    "description": "Comments:I've had an overall good experience with PayPal. It's made my life easier.",
    "date": "4 weeks ago\n  \n    New",
    "rating": 4,
    "pros": "I Iike that I'm able to cash out my virtual Visa cards and pay online fast",
    "cons": "I don't like that your account can be limited at any time for no reason."
  },
  {
    "title": "Paypal is easy",
    "description": "Comments:I've not had any issues with this software",
    "date": "3 weeks ago\n  \n    New",
    "rating": 5,
    "pros": "It is easy to pay for things using paypal",
    "cons": "I find it very straightforward to log in and pay"
  },
  {
    "title": "My experience with Paypal billing tool as a consumer",
    "description": "Comments:I have been utilizing PayPal as my primary billing tool for several months now, and I must say that it has significantly streamlined my online transactions.   Overall, I find PayPal essential for managing my billing needs for business-related financial management.",
    "date": "last month\n  \n    New",
    "rating": 5,
    "pros": "The user interface is intuitive, making it easy to navigate through the various features. Additionally, PayPal's integration with other platforms enhances its functionality and overall convenience.",
    "cons": "There have been moments when customer service response times were slower than expected."
  },
  {
    "title": "Great overall, with little room for improvement.",
    "description": "Comments:Overall I really like PayPal and am nit-picking to find things I like least. Overall it's been great both personally and professionally.",
    "date": "3 months ago",
    "rating": 4,
    "pros": "I like having a debit card specific to this, because that's where I store our businesses funds like a checking account. I like the ability to create and accept payments for invoices. I also like that I can use PayPal for personal transactions just like Venmo or Zelle.",
    "cons": "I wish their UI were better. Certain features seem challenging to find or access. Specifically the add a payment or add money feature. I wish they'd use intelligence to learn what I use most and bring that to the front of the dashboard."
  },
  {
    "title": "Paypal is the standard by which all payment processing is measured.",
    "description": "Comments:Paypal is an all in one solution enabling credit, debit, paypal, venmo, apple pay and google pay.",
    "date": "3 months ago",
    "rating": 5,
    "pros": "The brand recognition is huge! So many people use or at least know of paypal that offering it increases consumer confidence.",
    "cons": "Some of the company policies and practices do not line up with ours."
  },
  {
    "title": "Paypal is horrible",
    "description": "Comments:Very horrible and theyre the worst pay company ive ever had the displeasure of dealing with. Their ceo is a fake and liar too.",
    "date": "11 months ago",
    "rating": 1,
    "pros": "I like that they atleast guve you screenshot able evidence so later i have the proof on court even if they delete the account.",
    "cons": "They steal money and hold business funds under the guise of security but allow money laundering by other means for non-vetted accounts while they punish the business ones."
  },
  {
    "title": "Payments made easy with PayPal",
    "description": "Comments:PayPal provides secure transactions, convenience, and excellent buyer protection, ensuring a satisfying experience for online purchases and transactions.",
    "date": "11 months ago",
    "rating": 5,
    "pros": "It's widely accepted online and offers buyer and seller protection.",
    "cons": "PayPal sometimes charges fees \nfor certain transactions and  Occasionally freezes accounts"
  },
  {
    "title": "Convenient and time-saving!",
    "description": "Comments:I enjoy the convenience and time-saving feature while checking out with online retailers, but I typically will use Venmo to send/receive money with friends and family - I used PayPal for that in the past. As long as my account stays secure, I will continue to use PayPal.",
    "date": "4 months ago",
    "rating": 4,
    "pros": "I absolutely love the option to checkout with online retailers by using PayPal. The convenience of not having to type in my credit card number is the best feature in my opinion.",
    "cons": "A couple years ago, my PayPal account was hacked into. I received an email that an online virtual bakery was opened with my account. Terrified, I contacted PayPal and demanded they close my account. They refused and stated that the business that was registered to my account was deleted, and it would never happen again. Being that PayPal is connected to my bank and my credit card, I was mortified that security was not strong enough to keep someone from hacking into it."
  },
  {
    "title": "Pay Pal  Business",
    "description": "Comments:My overall experience with pay pal is excellent it has given me the freedom to send money to my family, to invoice a customer from another city or state and receive money in minutes. It is a very reliable system and I recommend pay pal to any one it is awesome all for businesses worldwide.",
    "date": "6 months ago",
    "rating": 5,
    "pros": "I love using pay pal privately with a customer or online shopping it give me the comfort to make payments create invoices for clients send or receive money from friends and family. Pay Pal is a great way to do business world wide.",
    "cons": "There's not much I don't like about pay pal they are very punctual reliable and you get your payments on time . It lets you know every detail and transaction you have made pay pal is a great way to receive and send money."
  },
  {
    "title": "PayPal-It's Been a Long Great Trip",
    "description": "Comments:Since 2006, both PayPal and my business have gone through changes, and both of us have had good and bad changes. PayPal has changed for the good (so have I, but this is not about me) and sometimes it is a hassle to learn these changes but that is just part of the business. \nOverall, like any long-term relationship, there are ups and downs; luckily for me, the downs are short, and the u[ps are long.",
    "date": "3 months ago",
    "rating": 5,
    "pros": "Reliability is at the top of the list. PayPal as been around as long as I've been doing business online.",
    "cons": "Listing something of a Con with PayPal is difficult because everything I think of turns out to be 'operator error' and has little to do with PayPal itself. I am sure there are negative points to any system that holds onto your funds, but so far (since 2006), I have not encountered any. <knocks on wood>"
  },
  {
    "title": "i really liked my paypal experience",
    "description": "Comments:As a user of PayPal for nearly eight years, I concluded that it maintains the security and confidentiality of user data, and there is no room for anyone to scamming the other, which increases the trust of customers, and I personally recommend it to everyone I know",
    "date": "8 months ago",
    "rating": 5,
    "pros": "What I like a most about PayPal is that it is easy to use and more than that our data is safe and protected",
    "cons": "Frankly, so far I have not faced any problem, so there are no negatives that I have about PayPal"
  },
  {
    "title": "PayPal refuses to close my account",
    "description": "Comments:I have been a user for 13 yrs, but I want to close my account  --- PayPal refuses to do this!  I had a bad experience with a $754.00 charge from LinkedIn for 1 yr of Prime service, but I cancelled it within 28 days, and there was supposed to be no charge.  LinkedIn billed me anyway, and when I put in a complaint to PayPal they told me I still had to pay them.  I then appealed to PayPal, then they told me their protection from fraud in this case was not covered!!  Whaat??  LinkedIn finally gave me a $754.00 credit, so my account has a ZERO balance, so I again asked to close my account ---- then they told me I couldn't because I had a Honey PayPal (I never applied for this, nor did I ever receive any rewards or points on this), so I contacted Honey and they cancelled this so-called account I had.  PayPal still refused to close my account, even though I sent the details of the LinkedIn credit and the fact that they billed me in error.  Now PayPal tells me they need to \"verify\" my identity.  They already have my name, address, bank account number, e-mail.  They are demanding I send them ID such as my Driver's license, Passport, credit card bill, Federal tax # (doesn't exist in Canada I told them), or they refuse to cancel my account.  I told them they never asked for this when I opened my account, why do they need this to close my account -- no answer.  I am not sending them any personal credit details, have they not heard of \"identity fraud?\"  They have refused me to escalate to a Manager, refused me their e-mail address, mailing address, and I feel like I am being black-mailed.  If they try t charge me non-use fees I will not pay them. I was forced to contact the Consumer Protection Agency in Canada to file a formal complaint against them.  Moral of story --- DO NOT USE PAYPAL, find another way to pay for your goods!",
    "date": "7 months ago",
    "rating": 1,
    "pros": "PayPal used to have good customer service, but not anymore.  They have subbed it out to the Philippines, and they don't care about you at all.  Sometimes I can't even understand what they are saying.",
    "cons": "I don't like their fees for non-use for 1 year. They charge you a penalty if you don't use your PayPal after 1 year.  They also charge a lot for exchange on money currencies."
  },
  {
    "title": "PayPal helps keep my business runng.",
    "description": "",
    "date": "7 months ago",
    "rating": 5,
    "pros": "Running my business with PayPal has been a game-changer. It's smooth, secure, and makes everything from sending invoices to receiving payments a breeze.\n\nSetting up the account was a walk in the park, and integrating it with my existing system took no time at all. The interface is super user-friendly, so even if you're not a tech whiz, you'll be navigating it like a pro in no time.\n\nSecurity is a major concern for any business dealing with online transactions, and PayPal definitely delivers. Their advanced features put my mind at ease, knowing both my business and my clients are protected.  Honestly, I've never had any issues with fraud, which is a huge weight off my shoulders.\n\nAnother perk I love is the ability to access my funds quickly. With PayPal's instant transfer options, I can get my money when I need it, keeping my cash flow healthy and my business running smoothly.\n\nThe customer service is top-notch too. The few times I've needed help, their team has been incredibly responsive, helpful, and professional. It's a great feeling knowing they're there if I ever run into anything.\n\nAll in all, if you're looking for a reliable, secure, and user-friendly payment solution for your business,  I can't recommend PayPal enough. My experience has been fantastic, and I'm sure you'll be happy with it too",
    "cons": "Sometimes I have a difficult time locating things that I want.  This very well may not be PayPal, but me."
  },
  {
    "title": "This Company is Commiting Insider Fraud and Scams From the Fraud Department",
    "description": "Comments:Without a doubt, PayPal Credit's Fraud Department is behind the mass scams going on with clients' accounts. Just like most of the others who have left feedback, money has come up missing, and I caught them lying about it from the beginning. I put money into an online wallet, which they returned within two hours; I hadn't bought anything with it, and it was simply for future work. I confronted them right away about the missing money in August, and they said I had reported it as fraud, which was a complete lie. I have proof. I immediately said that I never claimed it was fraud; someone at PayPal Credit did. I began to ask for proof of me reporting it as fraud because I could have withdrawn it. That's when they admitted on three occasions that someone from the Fraud Department performed the return. Then, they would claim I did, then they would claim they did. Now again, they are claiming I did and had bought something with it. However, I don't believe they contacted the company because you don't purchase when you put money in the wallet. You add money to your wallet and then decide to purchase, so what they were saying didn't add up. The other company provided a refund number, saying they refunded it right away in August. I have eight official letters from them confirming it was returned, and PayPal Credit is falsely claiming they didn't and kept it for products I received, which is not true at all. The way they described why they kept the money doesn't make sense in terms of how this company does business. They kept telling me to talk to the other company, sending me in circles. Not to mention, I never requested the money to be returned; the PayPal Credit Fraud Department did, and now it's lost. I shouldn't be responsible for it; they initiated it. I have official correspondence where I'm telling the company I never requested the money be taken out of my wallet in August. Come to October 7, 2023, they had made a new account and forwarded the $1,227.00, making me pay for it. It's crazy how the money I caught them lying about ended up missing and, months later, was forwarded to my account. Now, they are making me pay for something they did in the first place. Not only do I have to pay for the missing money that they returned, but now they are also making me pay interest on it. I filed official police reports and contacted the Better Business Bureau. The Fraud Department is pocketing all this money; it's clear to see, with all these similar stories of PayPal Credit creating new accounts without clients' permission or knowledge, forwarding balances, pretending not to understand anything you're saying, spinning you in circles, and making up stuff that doesn't make sense. Too many of us are experiencing money just disappearing. It's going somewhere into someone's pocket, which isn't fair to us as consumers. Be very aware of the scams and fraud being committed by them and use caution.",
    "date": "10 months ago",
    "rating": 1,
    "pros": "Nothing at all anymore because they are untrustworthy.",
    "cons": "They are stealing mass consumers money. \nThey will create new accounts and request for your money to be returned without permission, then say you did it, then the money will come up 100% missing, after they were caught lying in the first place. \nThey will then make you pay back the money, that they clearly stole from you back and interest too."
  },
  {
    "title": "What I Know About PayPal Payment Gateway",
    "description": "",
    "date": "4 months ago",
    "rating": 5,
    "pros": "PayPal allows me to send and receive payments instantly from any corner of the globe.\nThe best part is that it allows users without account to make payments outside PP through credit cards.",
    "cons": "My account was limited late last year but it was reinstated after a long debate with customer support."
  },
  {
    "title": "PayPal makes payments easy",
    "description": "Comments:Overall I am really pleased with PayPal. It has helped me resolve disputes with customers and provides a sense of confidence for consumers.",
    "date": "last month\n  \n    New",
    "rating": 5,
    "pros": "PayPal is a great platform for consumers and businesses. It gives people the confidence of a secure platform for transactions. It's new and updated escalation procedures also make it easy for customers to dispute payments,",
    "cons": "One of the cons I have found with PayPal is that it is no longer possible to make collections without a fee. This was a useful tool in our office when we were doing a present for someone in the office."
  },
  {
    "title": "Tye's PayPal review",
    "description": "Comments:Easy to use, great for collecting or distributing payments.",
    "date": "10 months ago",
    "rating": 5,
    "pros": "I like the nice looking UI \nI like that it's very user-friendly\nI like that it processes transactions instantly\nI like that it's easy to find people you frequently do business with and send or request money quickly",
    "cons": "I don't like the high transactions fees on small transactions, trying to send your friend a dollar can cost upwards of $5 sometimes its ridiculous\nI don't like how sometimes it can take a week for debit/credit purchases to process"
  },
  {
    "title": "Why Pay with PayPal",
    "description": "",
    "date": "3 months ago",
    "rating": 5,
    "pros": "PayPal protect sellers and buyers against fraud which is one of the best aspects so far.\nAdditionally, PayPal charging fee is friendly compared to alternatives such as Payoneer.",
    "cons": "I 💯 % lack any aspect which I can term as a flaw at the moment."
  },
  {
    "title": "Reliable and convenient tool for handling both personal and business transactions",
    "description": "Comments:PayPal has been a reliable and convenient tool for handling both personal and business transactions. While the fees can add up in some cases, its security features and ease of use make it a top choice for online payments.",
    "date": "2 months ago",
    "rating": 5,
    "pros": "Convenience and extensive acceptance. PayPal allows me to make purchases, send money, and receive payments quickly, both domestically and internationally. Its buyer and seller protection policies offer a sense of security, especially for online transactions. The platform’s integration with various websites and apps is seamless, making it easy to use almost anywhere.",
    "cons": "Fees associated with certain types of transactions, especially for currency conversion and receiving business payments. Additionally, the customer service experience can sometimes be slow or challenging to navigate if there are account or payment issues."
  },
  {
    "title": "Use paypal for an easy and effective payment solution!",
    "description": "Comments:Paypal makes making and recieving payments an absolute breeze, and its smart features make life so easy!",
    "date": "2 months ago\n  \n    New",
    "rating": 5,
    "pros": "Paypal offers a seamless and easy payment processing platform that helps life run more smoothly.",
    "cons": "I have had no issues with paypal in my time using it."
  },
  {
    "title": "Paypal's lack of transparency and efficient communication makes it a risky option as a financial provider.",
    "description": "Comments:Paypal places many barriers between the customer and vital information making my overall experience very frustrating. This is made even more inconvenient by the lack of online support making it difficult to reach the right people when a problem arises. Paypal has caused numerous disruptions in my financial well being due to these issues.",
    "date": "last month\n  \n    New",
    "rating": 2,
    "pros": "Paypal is widely accepted as a payment option for online transactions, making it a convenient payment option when shopping online.",
    "cons": "Lack of account transparency such as the ability to view declined transactions. Additionally, the lack of easily accessible online support like many other payment providers offer as their digital experience. There does not seem to be any explanation as to why users are unable to view declined transactions and where the charge is coming from. This is extremely inconvenient and is potentially a security risk as monitoring all transactions towards any funding account is essential for monitoring unusual activity."
  },
  {
    "title": "PayPal review",
    "description": "Comments:My experience with PayPal has been mostly positive. It’s convenient for online shopping, sending money, and receiving payments. The user interface is simple, and transactions are generally fast and secure, which I appreciate. However, the high fees, especially with currency conversion or business transactions, can be a downside. Additionally, the occasional hold on funds can be frustrating when I need quick access to money. Despite these issues, PayPal remains a reliable option for online payments.",
    "date": "3 months ago",
    "rating": 5,
    "pros": "PayPal is very user friendly. I like how PayPal makes online payments so simple and secure. It’s convenient for both personal transactions and business, with the ability to link bank accounts or cards and pay without exposing financial information. The buyer protection is a nice safety net too, and it integrates with tons of websites and apps.",
    "cons": "What I like least about PayPal is the high fees, especially when converting currencies or handling business transactions. It also holds funds sometimes for extended periods, which can be frustrating if you need quick access to your money."
  },
  {
    "title": "PayPal-Big things come in small packages.",
    "description": "Comments:My overall experience is quit good with PayPal. I've been using them for 20 years. They have been number one go to for sending and receiving money before Cashapp and Venmo were ever around. I still use PayPal for online sales and big transactions because to me they are the most reliable and easy to access past payments received and sent, very organized. One of my favorite things is being able to send professional invoices to clients.",
    "date": "3 weeks ago\n  \n    New",
    "rating": 4,
    "pros": "I like how PayPal creates an easy user experience.",
    "cons": "What I like least about PayPal is the high transaction fee and per transaction fee for sending and receiving."
  },
  {
    "title": "paypal ... good until it isnt",
    "description": "Comments:for the majority of the time i found it extremely effective in money management",
    "date": "4 weeks ago\n  \n    New",
    "rating": 5,
    "pros": "i liked the fact you can send invoices , send payments to visa direct or venmo and accept swipe paymemts as well",
    "cons": "the security is great however it lacks unatuomated overides from custmer service representatives and inforces verification protocols that cant be addressed by sparsly available cusotmer service"
  },
  {
    "title": "My review about PayPal and what I love about it",
    "description": "Comments:PayPal is really good and I can always use it to put my money on my HSBC debit card.",
    "date": "4 weeks ago\n  \n    New",
    "rating": 5,
    "pros": "PayPal is something you can use to withdraw your money into your bank. You can also use PayPal to buy stuff on eBay as well and you can also use PayPal to add money.",
    "cons": "It can sometimes give me errors and it logs me out automatically for no reason."
  },
  {
    "title": "Pay with PayPal...",
    "description": "Comments:I've had an overall good experience with PayPal. It's made my life easier.",
    "date": "4 weeks ago\n  \n    New",
    "rating": 4,
    "pros": "I Iike that I'm able to cash out my virtual Visa cards and pay online fast",
    "cons": "I don't like that your account can be limited at any time for no reason."
  },
  {
    "title": "Paypal is easy",
    "description": "Comments:I've not had any issues with this software",
    "date": "3 weeks ago\n  \n    New",
    "rating": 5,
    "pros": "It is easy to pay for things using paypal",
    "cons": "I find it very straightforward to log in and pay"
  },
  {
    "title": "My experience with Paypal billing tool as a consumer",
    "description": "Comments:I have been utilizing PayPal as my primary billing tool for several months now, and I must say that it has significantly streamlined my online transactions.   Overall, I find PayPal essential for managing my billing needs for business-related financial management.",
    "date": "last month\n  \n    New",
    "rating": 5,
    "pros": "The user interface is intuitive, making it easy to navigate through the various features. Additionally, PayPal's integration with other platforms enhances its functionality and overall convenience.",
    "cons": "There have been moments when customer service response times were slower than expected."
  },
  {
    "title": "Great overall, with little room for improvement.",
    "description": "Comments:Overall I really like PayPal and am nit-picking to find things I like least. Overall it's been great both personally and professionally.",
    "date": "3 months ago",
    "rating": 4,
    "pros": "I like having a debit card specific to this, because that's where I store our businesses funds like a checking account. I like the ability to create and accept payments for invoices. I also like that I can use PayPal for personal transactions just like Venmo or Zelle.",
    "cons": "I wish their UI were better. Certain features seem challenging to find or access. Specifically the add a payment or add money feature. I wish they'd use intelligence to learn what I use most and bring that to the front of the dashboard."
  },
  {
    "title": "Paypal is the standard by which all payment processing is measured.",
    "description": "Comments:Paypal is an all in one solution enabling credit, debit, paypal, venmo, apple pay and google pay.",
    "date": "3 months ago",
    "rating": 5,
    "pros": "The brand recognition is huge! So many people use or at least know of paypal that offering it increases consumer confidence.",
    "cons": "Some of the company policies and practices do not line up with ours."
  },
  {
    "title": "Paypal is horrible",
    "description": "Comments:Very horrible and theyre the worst pay company ive ever had the displeasure of dealing with. Their ceo is a fake and liar too.",
    "date": "11 months ago",
    "rating": 1,
    "pros": "I like that they atleast guve you screenshot able evidence so later i have the proof on court even if they delete the account.",
    "cons": "They steal money and hold business funds under the guise of security but allow money laundering by other means for non-vetted accounts while they punish the business ones."
  },
  {
    "title": "Payments made easy with PayPal",
    "description": "Comments:PayPal provides secure transactions, convenience, and excellent buyer protection, ensuring a satisfying experience for online purchases and transactions.",
    "date": "11 months ago",
    "rating": 5,
    "pros": "It's widely accepted online and offers buyer and seller protection.",
    "cons": "PayPal sometimes charges fees \nfor certain transactions and  Occasionally freezes accounts"
  },
  {
    "title": "Convenient and time-saving!",
    "description": "Comments:I enjoy the convenience and time-saving feature while checking out with online retailers, but I typically will use Venmo to send/receive money with friends and family - I used PayPal for that in the past. As long as my account stays secure, I will continue to use PayPal.",
    "date": "4 months ago",
    "rating": 4,
    "pros": "I absolutely love the option to checkout with online retailers by using PayPal. The convenience of not having to type in my credit card number is the best feature in my opinion.",
    "cons": "A couple years ago, my PayPal account was hacked into. I received an email that an online virtual bakery was opened with my account. Terrified, I contacted PayPal and demanded they close my account. They refused and stated that the business that was registered to my account was deleted, and it would never happen again. Being that PayPal is connected to my bank and my credit card, I was mortified that security was not strong enough to keep someone from hacking into it."
  },
  {
    "title": "Pay Pal  Business",
    "description": "Comments:My overall experience with pay pal is excellent it has given me the freedom to send money to my family, to invoice a customer from another city or state and receive money in minutes. It is a very reliable system and I recommend pay pal to any one it is awesome all for businesses worldwide.",
    "date": "6 months ago",
    "rating": 5,
    "pros": "I love using pay pal privately with a customer or online shopping it give me the comfort to make payments create invoices for clients send or receive money from friends and family. Pay Pal is a great way to do business world wide.",
    "cons": "There's not much I don't like about pay pal they are very punctual reliable and you get your payments on time . It lets you know every detail and transaction you have made pay pal is a great way to receive and send money."
  },
  {
    "title": "PayPal-It's Been a Long Great Trip",
    "description": "Comments:Since 2006, both PayPal and my business have gone through changes, and both of us have had good and bad changes. PayPal has changed for the good (so have I, but this is not about me) and sometimes it is a hassle to learn these changes but that is just part of the business. \nOverall, like any long-term relationship, there are ups and downs; luckily for me, the downs are short, and the u[ps are long.",
    "date": "3 months ago",
    "rating": 5,
    "pros": "Reliability is at the top of the list. PayPal as been around as long as I've been doing business online.",
    "cons": "Listing something of a Con with PayPal is difficult because everything I think of turns out to be 'operator error' and has little to do with PayPal itself. I am sure there are negative points to any system that holds onto your funds, but so far (since 2006), I have not encountered any. <knocks on wood>"
  },
  {
    "title": "i really liked my paypal experience",
    "description": "Comments:As a user of PayPal for nearly eight years, I concluded that it maintains the security and confidentiality of user data, and there is no room for anyone to scamming the other, which increases the trust of customers, and I personally recommend it to everyone I know",
    "date": "8 months ago",
    "rating": 5,
    "pros": "What I like a most about PayPal is that it is easy to use and more than that our data is safe and protected",
    "cons": "Frankly, so far I have not faced any problem, so there are no negatives that I have about PayPal"
  },
  {
    "title": "PayPal refuses to close my account",
    "description": "Comments:I have been a user for 13 yrs, but I want to close my account  --- PayPal refuses to do this!  I had a bad experience with a $754.00 charge from LinkedIn for 1 yr of Prime service, but I cancelled it within 28 days, and there was supposed to be no charge.  LinkedIn billed me anyway, and when I put in a complaint to PayPal they told me I still had to pay them.  I then appealed to PayPal, then they told me their protection from fraud in this case was not covered!!  Whaat??  LinkedIn finally gave me a $754.00 credit, so my account has a ZERO balance, so I again asked to close my account ---- then they told me I couldn't because I had a Honey PayPal (I never applied for this, nor did I ever receive any rewards or points on this), so I contacted Honey and they cancelled this so-called account I had.  PayPal still refused to close my account, even though I sent the details of the LinkedIn credit and the fact that they billed me in error.  Now PayPal tells me they need to \"verify\" my identity.  They already have my name, address, bank account number, e-mail.  They are demanding I send them ID such as my Driver's license, Passport, credit card bill, Federal tax # (doesn't exist in Canada I told them), or they refuse to cancel my account.  I told them they never asked for this when I opened my account, why do they need this to close my account -- no answer.  I am not sending them any personal credit details, have they not heard of \"identity fraud?\"  They have refused me to escalate to a Manager, refused me their e-mail address, mailing address, and I feel like I am being black-mailed.  If they try t charge me non-use fees I will not pay them. I was forced to contact the Consumer Protection Agency in Canada to file a formal complaint against them.  Moral of story --- DO NOT USE PAYPAL, find another way to pay for your goods!",
    "date": "7 months ago",
    "rating": 1,
    "pros": "PayPal used to have good customer service, but not anymore.  They have subbed it out to the Philippines, and they don't care about you at all.  Sometimes I can't even understand what they are saying.",
    "cons": "I don't like their fees for non-use for 1 year. They charge you a penalty if you don't use your PayPal after 1 year.  They also charge a lot for exchange on money currencies."
  },
  {
    "title": "PayPal helps keep my business runng.",
    "description": "",
    "date": "7 months ago",
    "rating": 5,
    "pros": "Running my business with PayPal has been a game-changer. It's smooth, secure, and makes everything from sending invoices to receiving payments a breeze.\n\nSetting up the account was a walk in the park, and integrating it with my existing system took no time at all. The interface is super user-friendly, so even if you're not a tech whiz, you'll be navigating it like a pro in no time.\n\nSecurity is a major concern for any business dealing with online transactions, and PayPal definitely delivers. Their advanced features put my mind at ease, knowing both my business and my clients are protected.  Honestly, I've never had any issues with fraud, which is a huge weight off my shoulders.\n\nAnother perk I love is the ability to access my funds quickly. With PayPal's instant transfer options, I can get my money when I need it, keeping my cash flow healthy and my business running smoothly.\n\nThe customer service is top-notch too. The few times I've needed help, their team has been incredibly responsive, helpful, and professional. It's a great feeling knowing they're there if I ever run into anything.\n\nAll in all, if you're looking for a reliable, secure, and user-friendly payment solution for your business,  I can't recommend PayPal enough. My experience has been fantastic, and I'm sure you'll be happy with it too",
    "cons": "Sometimes I have a difficult time locating things that I want.  This very well may not be PayPal, but me."
  },
  {
    "title": "This Company is Commiting Insider Fraud and Scams From the Fraud Department",
    "description": "Comments:Without a doubt, PayPal Credit's Fraud Department is behind the mass scams going on with clients' accounts. Just like most of the others who have left feedback, money has come up missing, and I caught them lying about it from the beginning. I put money into an online wallet, which they returned within two hours; I hadn't bought anything with it, and it was simply for future work. I confronted them right away about the missing money in August, and they said I had reported it as fraud, which was a complete lie. I have proof. I immediately said that I never claimed it was fraud; someone at PayPal Credit did. I began to ask for proof of me reporting it as fraud because I could have withdrawn it. That's when they admitted on three occasions that someone from the Fraud Department performed the return. Then, they would claim I did, then they would claim they did. Now again, they are claiming I did and had bought something with it. However, I don't believe they contacted the company because you don't purchase when you put money in the wallet. You add money to your wallet and then decide to purchase, so what they were saying didn't add up. The other company provided a refund number, saying they refunded it right away in August. I have eight official letters from them confirming it was returned, and PayPal Credit is falsely claiming they didn't and kept it for products I received, which is not true at all. The way they described why they kept the money doesn't make sense in terms of how this company does business. They kept telling me to talk to the other company, sending me in circles. Not to mention, I never requested the money to be returned; the PayPal Credit Fraud Department did, and now it's lost. I shouldn't be responsible for it; they initiated it. I have official correspondence where I'm telling the company I never requested the money be taken out of my wallet in August. Come to October 7, 2023, they had made a new account and forwarded the $1,227.00, making me pay for it. It's crazy how the money I caught them lying about ended up missing and, months later, was forwarded to my account. Now, they are making me pay for something they did in the first place. Not only do I have to pay for the missing money that they returned, but now they are also making me pay interest on it. I filed official police reports and contacted the Better Business Bureau. The Fraud Department is pocketing all this money; it's clear to see, with all these similar stories of PayPal Credit creating new accounts without clients' permission or knowledge, forwarding balances, pretending not to understand anything you're saying, spinning you in circles, and making up stuff that doesn't make sense. Too many of us are experiencing money just disappearing. It's going somewhere into someone's pocket, which isn't fair to us as consumers. Be very aware of the scams and fraud being committed by them and use caution.",
    "date": "10 months ago",
    "rating": 1,
    "pros": "Nothing at all anymore because they are untrustworthy.",
    "cons": "They are stealing mass consumers money. \nThey will create new accounts and request for your money to be returned without permission, then say you did it, then the money will come up 100% missing, after they were caught lying in the first place. \nThey will then make you pay back the money, that they clearly stole from you back and interest too."
  },
  {
    "title": "What I Know About PayPal Payment Gateway",
    "description": "",
    "date": "4 months ago",
    "rating": 5,
    "pros": "PayPal allows me to send and receive payments instantly from any corner of the globe.\nThe best part is that it allows users without account to make payments outside PP through credit cards.",
    "cons": "My account was limited late last year but it was reinstated after a long debate with customer support."
  },
  {
    "title": "PayPal makes payments easy",
    "description": "Comments:Overall I am really pleased with PayPal. It has helped me resolve disputes with customers and provides a sense of confidence for consumers.",
    "date": "last month\n  \n    New",
    "rating": 5,
    "pros": "PayPal is a great platform for consumers and businesses. It gives people the confidence of a secure platform for transactions. It's new and updated escalation procedures also make it easy for customers to dispute payments,",
    "cons": "One of the cons I have found with PayPal is that it is no longer possible to make collections without a fee. This was a useful tool in our office when we were doing a present for someone in the office."
  },
  {
    "title": "Tye's PayPal review",
    "description": "Comments:Easy to use, great for collecting or distributing payments.",
    "date": "10 months ago",
    "rating": 5,
    "pros": "I like the nice looking UI \nI like that it's very user-friendly\nI like that it processes transactions instantly\nI like that it's easy to find people you frequently do business with and send or request money quickly",
    "cons": "I don't like the high transactions fees on small transactions, trying to send your friend a dollar can cost upwards of $5 sometimes its ridiculous\nI don't like how sometimes it can take a week for debit/credit purchases to process"
  },
  {
    "title": "Why Pay with PayPal",
    "description": "",
    "date": "3 months ago",
    "rating": 5,
    "pros": "PayPal protect sellers and buyers against fraud which is one of the best aspects so far.\nAdditionally, PayPal charging fee is friendly compared to alternatives such as Payoneer.",
    "cons": "I 💯 % lack any aspect which I can term as a flaw at the moment."
  },
  {
    "title": "Reliable and convenient tool for handling both personal and business transactions",
    "description": "Comments:PayPal has been a reliable and convenient tool for handling both personal and business transactions. While the fees can add up in some cases, its security features and ease of use make it a top choice for online payments.",
    "date": "2 months ago",
    "rating": 5,
    "pros": "Convenience and extensive acceptance. PayPal allows me to make purchases, send money, and receive payments quickly, both domestically and internationally. Its buyer and seller protection policies offer a sense of security, especially for online transactions. The platform’s integration with various websites and apps is seamless, making it easy to use almost anywhere.",
    "cons": "Fees associated with certain types of transactions, especially for currency conversion and receiving business payments. Additionally, the customer service experience can sometimes be slow or challenging to navigate if there are account or payment issues."
  },
  {
    "title": "Use paypal for an easy and effective payment solution!",
    "description": "Comments:Paypal makes making and recieving payments an absolute breeze, and its smart features make life so easy!",
    "date": "2 months ago\n  \n    New",
    "rating": 5,
    "pros": "Paypal offers a seamless and easy payment processing platform that helps life run more smoothly.",
    "cons": "I have had no issues with paypal in my time using it."
  },
  {
    "title": "Paypal's lack of transparency and efficient communication makes it a risky option as a financial provider.",
    "description": "Comments:Paypal places many barriers between the customer and vital information making my overall experience very frustrating. This is made even more inconvenient by the lack of online support making it difficult to reach the right people when a problem arises. Paypal has caused numerous disruptions in my financial well being due to these issues.",
    "date": "last month\n  \n    New",
    "rating": 2,
    "pros": "Paypal is widely accepted as a payment option for online transactions, making it a convenient payment option when shopping online.",
    "cons": "Lack of account transparency such as the ability to view declined transactions. Additionally, the lack of easily accessible online support like many other payment providers offer as their digital experience. There does not seem to be any explanation as to why users are unable to view declined transactions and where the charge is coming from. This is extremely inconvenient and is potentially a security risk as monitoring all transactions towards any funding account is essential for monitoring unusual activity."
  },
  {
    "title": "PayPal review",
    "description": "Comments:My experience with PayPal has been mostly positive. It’s convenient for online shopping, sending money, and receiving payments. The user interface is simple, and transactions are generally fast and secure, which I appreciate. However, the high fees, especially with currency conversion or business transactions, can be a downside. Additionally, the occasional hold on funds can be frustrating when I need quick access to money. Despite these issues, PayPal remains a reliable option for online payments.",
    "date": "3 months ago",
    "rating": 5,
    "pros": "PayPal is very user friendly. I like how PayPal makes online payments so simple and secure. It’s convenient for both personal transactions and business, with the ability to link bank accounts or cards and pay without exposing financial information. The buyer protection is a nice safety net too, and it integrates with tons of websites and apps.",
    "cons": "What I like least about PayPal is the high fees, especially when converting currencies or handling business transactions. It also holds funds sometimes for extended periods, which can be frustrating if you need quick access to your money."
  },
  {
    "title": "PayPal-Big things come in small packages.",
    "description": "Comments:My overall experience is quit good with PayPal. I've been using them for 20 years. They have been number one go to for sending and receiving money before Cashapp and Venmo were ever around. I still use PayPal for online sales and big transactions because to me they are the most reliable and easy to access past payments received and sent, very organized. One of my favorite things is being able to send professional invoices to clients.",
    "date": "3 weeks ago\n  \n    New",
    "rating": 4,
    "pros": "I like how PayPal creates an easy user experience.",
    "cons": "What I like least about PayPal is the high transaction fee and per transaction fee for sending and receiving."
  },
  {
    "title": "paypal ... good until it isnt",
    "description": "Comments:for the majority of the time i found it extremely effective in money management",
    "date": "4 weeks ago\n  \n    New",
    "rating": 5,
    "pros": "i liked the fact you can send invoices , send payments to visa direct or venmo and accept swipe paymemts as well",
    "cons": "the security is great however it lacks unatuomated overides from custmer service representatives and inforces verification protocols that cant be addressed by sparsly available cusotmer service"
  },
  {
    "title": "My review about PayPal and what I love about it",
    "description": "Comments:PayPal is really good and I can always use it to put my money on my HSBC debit card.",
    "date": "4 weeks ago\n  \n    New",
    "rating": 5,
    "pros": "PayPal is something you can use to withdraw your money into your bank. You can also use PayPal to buy stuff on eBay as well and you can also use PayPal to add money.",
    "cons": "It can sometimes give me errors and it logs me out automatically for no reason."
  },
  {
    "title": "Pay with PayPal...",
    "description": "Comments:I've had an overall good experience with PayPal. It's made my life easier.",
    "date": "4 weeks ago\n  \n    New",
    "rating": 4,
    "pros": "I Iike that I'm able to cash out my virtual Visa cards and pay online fast",
    "cons": "I don't like that your account can be limited at any time for no reason."
  },
  {
    "title": "Paypal is easy",
    "description": "Comments:I've not had any issues with this software",
    "date": "3 weeks ago\n  \n    New",
    "rating": 5,
    "pros": "It is easy to pay for things using paypal",
    "cons": "I find it very straightforward to log in and pay"
  },
  {
    "title": "My experience with Paypal billing tool as a consumer",
    "description": "Comments:I have been utilizing PayPal as my primary billing tool for several months now, and I must say that it has significantly streamlined my online transactions.   Overall, I find PayPal essential for managing my billing needs for business-related financial management.",
    "date": "last month\n  \n    New",
    "rating": 5,
    "pros": "The user interface is intuitive, making it easy to navigate through the various features. Additionally, PayPal's integration with other platforms enhances its functionality and overall convenience.",
    "cons": "There have been moments when customer service response times were slower than expected."
  },
  {
    "title": "Great overall, with little room for improvement.",
    "description": "Comments:Overall I really like PayPal and am nit-picking to find things I like least. Overall it's been great both personally and professionally.",
    "date": "3 months ago",
    "rating": 4,
    "pros": "I like having a debit card specific to this, because that's where I store our businesses funds like a checking account. I like the ability to create and accept payments for invoices. I also like that I can use PayPal for personal transactions just like Venmo or Zelle.",
    "cons": "I wish their UI were better. Certain features seem challenging to find or access. Specifically the add a payment or add money feature. I wish they'd use intelligence to learn what I use most and bring that to the front of the dashboard."
  },
  {
    "title": "Paypal is the standard by which all payment processing is measured.",
    "description": "Comments:Paypal is an all in one solution enabling credit, debit, paypal, venmo, apple pay and google pay.",
    "date": "3 months ago",
    "rating": 5,
    "pros": "The brand recognition is huge! So many people use or at least know of paypal that offering it increases consumer confidence.",
    "cons": "Some of the company policies and practices do not line up with ours."
  },
  {
    "title": "Paypal is horrible",
    "description": "Comments:Very horrible and theyre the worst pay company ive ever had the displeasure of dealing with. Their ceo is a fake and liar too.",
    "date": "11 months ago",
    "rating": 1,
    "pros": "I like that they atleast guve you screenshot able evidence so later i have the proof on court even if they delete the account.",
    "cons": "They steal money and hold business funds under the guise of security but allow money laundering by other means for non-vetted accounts while they punish the business ones."
  },
  {
    "title": "Payments made easy with PayPal",
    "description": "Comments:PayPal provides secure transactions, convenience, and excellent buyer protection, ensuring a satisfying experience for online purchases and transactions.",
    "date": "11 months ago",
    "rating": 5,
    "pros": "It's widely accepted online and offers buyer and seller protection.",
    "cons": "PayPal sometimes charges fees \nfor certain transactions and  Occasionally freezes accounts"
  },
  {
    "title": "Convenient and time-saving!",
    "description": "Comments:I enjoy the convenience and time-saving feature while checking out with online retailers, but I typically will use Venmo to send/receive money with friends and family - I used PayPal for that in the past. As long as my account stays secure, I will continue to use PayPal.",
    "date": "4 months ago",
    "rating": 4,
    "pros": "I absolutely love the option to checkout with online retailers by using PayPal. The convenience of not having to type in my credit card number is the best feature in my opinion.",
    "cons": "A couple years ago, my PayPal account was hacked into. I received an email that an online virtual bakery was opened with my account. Terrified, I contacted PayPal and demanded they close my account. They refused and stated that the business that was registered to my account was deleted, and it would never happen again. Being that PayPal is connected to my bank and my credit card, I was mortified that security was not strong enough to keep someone from hacking into it."
  },
  {
    "title": "Pay Pal  Business",
    "description": "Comments:My overall experience with pay pal is excellent it has given me the freedom to send money to my family, to invoice a customer from another city or state and receive money in minutes. It is a very reliable system and I recommend pay pal to any one it is awesome all for businesses worldwide.",
    "date": "6 months ago",
    "rating": 5,
    "pros": "I love using pay pal privately with a customer or online shopping it give me the comfort to make payments create invoices for clients send or receive money from friends and family. Pay Pal is a great way to do business world wide.",
    "cons": "There's not much I don't like about pay pal they are very punctual reliable and you get your payments on time . It lets you know every detail and transaction you have made pay pal is a great way to receive and send money."
  },
  {
    "title": "PayPal-It's Been a Long Great Trip",
    "description": "Comments:Since 2006, both PayPal and my business have gone through changes, and both of us have had good and bad changes. PayPal has changed for the good (so have I, but this is not about me) and sometimes it is a hassle to learn these changes but that is just part of the business. \nOverall, like any long-term relationship, there are ups and downs; luckily for me, the downs are short, and the u[ps are long.",
    "date": "3 months ago",
    "rating": 5,
    "pros": "Reliability is at the top of the list. PayPal as been around as long as I've been doing business online.",
    "cons": "Listing something of a Con with PayPal is difficult because everything I think of turns out to be 'operator error' and has little to do with PayPal itself. I am sure there are negative points to any system that holds onto your funds, but so far (since 2006), I have not encountered any. <knocks on wood>"
  },
  {
    "title": "i really liked my paypal experience",
    "description": "Comments:As a user of PayPal for nearly eight years, I concluded that it maintains the security and confidentiality of user data, and there is no room for anyone to scamming the other, which increases the trust of customers, and I personally recommend it to everyone I know",
    "date": "8 months ago",
    "rating": 5,
    "pros": "What I like a most about PayPal is that it is easy to use and more than that our data is safe and protected",
    "cons": "Frankly, so far I have not faced any problem, so there are no negatives that I have about PayPal"
  },
  {
    "title": "PayPal refuses to close my account",
    "description": "Comments:I have been a user for 13 yrs, but I want to close my account  --- PayPal refuses to do this!  I had a bad experience with a $754.00 charge from LinkedIn for 1 yr of Prime service, but I cancelled it within 28 days, and there was supposed to be no charge.  LinkedIn billed me anyway, and when I put in a complaint to PayPal they told me I still had to pay them.  I then appealed to PayPal, then they told me their protection from fraud in this case was not covered!!  Whaat??  LinkedIn finally gave me a $754.00 credit, so my account has a ZERO balance, so I again asked to close my account ---- then they told me I couldn't because I had a Honey PayPal (I never applied for this, nor did I ever receive any rewards or points on this), so I contacted Honey and they cancelled this so-called account I had.  PayPal still refused to close my account, even though I sent the details of the LinkedIn credit and the fact that they billed me in error.  Now PayPal tells me they need to \"verify\" my identity.  They already have my name, address, bank account number, e-mail.  They are demanding I send them ID such as my Driver's license, Passport, credit card bill, Federal tax # (doesn't exist in Canada I told them), or they refuse to cancel my account.  I told them they never asked for this when I opened my account, why do they need this to close my account -- no answer.  I am not sending them any personal credit details, have they not heard of \"identity fraud?\"  They have refused me to escalate to a Manager, refused me their e-mail address, mailing address, and I feel like I am being black-mailed.  If they try t charge me non-use fees I will not pay them. I was forced to contact the Consumer Protection Agency in Canada to file a formal complaint against them.  Moral of story --- DO NOT USE PAYPAL, find another way to pay for your goods!",
    "date": "7 months ago",
    "rating": 1,
    "pros": "PayPal used to have good customer service, but not anymore.  They have subbed it out to the Philippines, and they don't care about you at all.  Sometimes I can't even understand what they are saying.",
    "cons": "I don't like their fees for non-use for 1 year. They charge you a penalty if you don't use your PayPal after 1 year.  They also charge a lot for exchange on money currencies."
  },
  {
    "title": "PayPal helps keep my business runng.",
    "description": "",
    "date": "7 months ago",
    "rating": 5,
    "pros": "Running my business with PayPal has been a game-changer. It's smooth, secure, and makes everything from sending invoices to receiving payments a breeze.\n\nSetting up the account was a walk in the park, and integrating it with my existing system took no time at all. The interface is super user-friendly, so even if you're not a tech whiz, you'll be navigating it like a pro in no time.\n\nSecurity is a major concern for any business dealing with online transactions, and PayPal definitely delivers. Their advanced features put my mind at ease, knowing both my business and my clients are protected.  Honestly, I've never had any issues with fraud, which is a huge weight off my shoulders.\n\nAnother perk I love is the ability to access my funds quickly. With PayPal's instant transfer options, I can get my money when I need it, keeping my cash flow healthy and my business running smoothly.\n\nThe customer service is top-notch too. The few times I've needed help, their team has been incredibly responsive, helpful, and professional. It's a great feeling knowing they're there if I ever run into anything.\n\nAll in all, if you're looking for a reliable, secure, and user-friendly payment solution for your business,  I can't recommend PayPal enough. My experience has been fantastic, and I'm sure you'll be happy with it too",
    "cons": "Sometimes I have a difficult time locating things that I want.  This very well may not be PayPal, but me."
  },
  {
    "title": "This Company is Commiting Insider Fraud and Scams From the Fraud Department",
    "description": "Comments:Without a doubt, PayPal Credit's Fraud Department is behind the mass scams going on with clients' accounts. Just like most of the others who have left feedback, money has come up missing, and I caught them lying about it from the beginning. I put money into an online wallet, which they returned within two hours; I hadn't bought anything with it, and it was simply for future work. I confronted them right away about the missing money in August, and they said I had reported it as fraud, which was a complete lie. I have proof. I immediately said that I never claimed it was fraud; someone at PayPal Credit did. I began to ask for proof of me reporting it as fraud because I could have withdrawn it. That's when they admitted on three occasions that someone from the Fraud Department performed the return. Then, they would claim I did, then they would claim they did. Now again, they are claiming I did and had bought something with it. However, I don't believe they contacted the company because you don't purchase when you put money in the wallet. You add money to your wallet and then decide to purchase, so what they were saying didn't add up. The other company provided a refund number, saying they refunded it right away in August. I have eight official letters from them confirming it was returned, and PayPal Credit is falsely claiming they didn't and kept it for products I received, which is not true at all. The way they described why they kept the money doesn't make sense in terms of how this company does business. They kept telling me to talk to the other company, sending me in circles. Not to mention, I never requested the money to be returned; the PayPal Credit Fraud Department did, and now it's lost. I shouldn't be responsible for it; they initiated it. I have official correspondence where I'm telling the company I never requested the money be taken out of my wallet in August. Come to October 7, 2023, they had made a new account and forwarded the $1,227.00, making me pay for it. It's crazy how the money I caught them lying about ended up missing and, months later, was forwarded to my account. Now, they are making me pay for something they did in the first place. Not only do I have to pay for the missing money that they returned, but now they are also making me pay interest on it. I filed official police reports and contacted the Better Business Bureau. The Fraud Department is pocketing all this money; it's clear to see, with all these similar stories of PayPal Credit creating new accounts without clients' permission or knowledge, forwarding balances, pretending not to understand anything you're saying, spinning you in circles, and making up stuff that doesn't make sense. Too many of us are experiencing money just disappearing. It's going somewhere into someone's pocket, which isn't fair to us as consumers. Be very aware of the scams and fraud being committed by them and use caution.",
    "date": "10 months ago",
    "rating": 1,
    "pros": "Nothing at all anymore because they are untrustworthy.",
    "cons": "They are stealing mass consumers money. \nThey will create new accounts and request for your money to be returned without permission, then say you did it, then the money will come up 100% missing, after they were caught lying in the first place. \nThey will then make you pay back the money, that they clearly stole from you back and interest too."
  },
  {
    "title": "What I Know About PayPal Payment Gateway",
    "description": "",
    "date": "4 months ago",
    "rating": 5,
    "pros": "PayPal allows me to send and receive payments instantly from any corner of the globe.\nThe best part is that it allows users without account to make payments outside PP through credit cards.",
    "cons": "My account was limited late last year but it was reinstated after a long debate with customer support."
  },
  {
    "title": "PayPal makes payments easy",
    "description": "Comments:Overall I am really pleased with PayPal. It has helped me resolve disputes with customers and provides a sense of confidence for consumers.",
    "date": "last month\n  \n    New",
    "rating": 5,
    "pros": "PayPal is a great platform for consumers and businesses. It gives people the confidence of a secure platform for transactions. It's new and updated escalation procedures also make it easy for customers to dispute payments,",
    "cons": "One of the cons I have found with PayPal is that it is no longer possible to make collections without a fee. This was a useful tool in our office when we were doing a present for someone in the office."
  },
  {
    "title": "Tye's PayPal review",
    "description": "Comments:Easy to use, great for collecting or distributing payments.",
    "date": "10 months ago",
    "rating": 5,
    "pros": "I like the nice looking UI \nI like that it's very user-friendly\nI like that it processes transactions instantly\nI like that it's easy to find people you frequently do business with and send or request money quickly",
    "cons": "I don't like the high transactions fees on small transactions, trying to send your friend a dollar can cost upwards of $5 sometimes its ridiculous\nI don't like how sometimes it can take a week for debit/credit purchases to process"
  },
  {
    "title": "Why Pay with PayPal",
    "description": "",
    "date": "3 months ago",
    "rating": 5,
    "pros": "PayPal protect sellers and buyers against fraud which is one of the best aspects so far.\nAdditionally, PayPal charging fee is friendly compared to alternatives such as Payoneer.",
    "cons": "I 💯 % lack any aspect which I can term as a flaw at the moment."
  },
  {
    "title": "Reliable and convenient tool for handling both personal and business transactions",
    "description": "Comments:PayPal has been a reliable and convenient tool for handling both personal and business transactions. While the fees can add up in some cases, its security features and ease of use make it a top choice for online payments.",
    "date": "2 months ago",
    "rating": 5,
    "pros": "Convenience and extensive acceptance. PayPal allows me to make purchases, send money, and receive payments quickly, both domestically and internationally. Its buyer and seller protection policies offer a sense of security, especially for online transactions. The platform’s integration with various websites and apps is seamless, making it easy to use almost anywhere.",
    "cons": "Fees associated with certain types of transactions, especially for currency conversion and receiving business payments. Additionally, the customer service experience can sometimes be slow or challenging to navigate if there are account or payment issues."
  },
  {
    "title": "Use paypal for an easy and effective payment solution!",
    "description": "Comments:Paypal makes making and recieving payments an absolute breeze, and its smart features make life so easy!",
    "date": "2 months ago\n  \n    New",
    "rating": 5,
    "pros": "Paypal offers a seamless and easy payment processing platform that helps life run more smoothly.",
    "cons": "I have had no issues with paypal in my time using it."
  },
  {
    "title": "Paypal's lack of transparency and efficient communication makes it a risky option as a financial provider.",
    "description": "Comments:Paypal places many barriers between the customer and vital information making my overall experience very frustrating. This is made even more inconvenient by the lack of online support making it difficult to reach the right people when a problem arises. Paypal has caused numerous disruptions in my financial well being due to these issues.",
    "date": "last month\n  \n    New",
    "rating": 2,
    "pros": "Paypal is widely accepted as a payment option for online transactions, making it a convenient payment option when shopping online.",
    "cons": "Lack of account transparency such as the ability to view declined transactions. Additionally, the lack of easily accessible online support like many other payment providers offer as their digital experience. There does not seem to be any explanation as to why users are unable to view declined transactions and where the charge is coming from. This is extremely inconvenient and is potentially a security risk as monitoring all transactions towards any funding account is essential for monitoring unusual activity."
  },
  {
    "title": "PayPal review",
    "description": "Comments:My experience with PayPal has been mostly positive. It’s convenient for online shopping, sending money, and receiving payments. The user interface is simple, and transactions are generally fast and secure, which I appreciate. However, the high fees, especially with currency conversion or business transactions, can be a downside. Additionally, the occasional hold on funds can be frustrating when I need quick access to money. Despite these issues, PayPal remains a reliable option for online payments.",
    "date": "3 months ago",
    "rating": 5,
    "pros": "PayPal is very user friendly. I like how PayPal makes online payments so simple and secure. It’s convenient for both personal transactions and business, with the ability to link bank accounts or cards and pay without exposing financial information. The buyer protection is a nice safety net too, and it integrates with tons of websites and apps.",
    "cons": "What I like least about PayPal is the high fees, especially when converting currencies or handling business transactions. It also holds funds sometimes for extended periods, which can be frustrating if you need quick access to your money."
  },
  {
    "title": "PayPal-Big things come in small packages.",
    "description": "Comments:My overall experience is quit good with PayPal. I've been using them for 20 years. They have been number one go to for sending and receiving money before Cashapp and Venmo were ever around. I still use PayPal for online sales and big transactions because to me they are the most reliable and easy to access past payments received and sent, very organized. One of my favorite things is being able to send professional invoices to clients.",
    "date": "3 weeks ago\n  \n    New",
    "rating": 4,
    "pros": "I like how PayPal creates an easy user experience.",
    "cons": "What I like least about PayPal is the high transaction fee and per transaction fee for sending and receiving."
  },
  {
    "title": "paypal ... good until it isnt",
    "description": "Comments:for the majority of the time i found it extremely effective in money management",
    "date": "4 weeks ago\n  \n    New",
    "rating": 5,
    "pros": "i liked the fact you can send invoices , send payments to visa direct or venmo and accept swipe paymemts as well",
    "cons": "the security is great however it lacks unatuomated overides from custmer service representatives and inforces verification protocols that cant be addressed by sparsly available cusotmer service"
  },
  {
    "title": "My review about PayPal and what I love about it",
    "description": "Comments:PayPal is really good and I can always use it to put my money on my HSBC debit card.",
    "date": "4 weeks ago\n  \n    New",
    "rating": 5,
    "pros": "PayPal is something you can use to withdraw your money into your bank. You can also use PayPal to buy stuff on eBay as well and you can also use PayPal to add money.",
    "cons": "It can sometimes give me errors and it logs me out automatically for no reason."
  },
  {
    "title": "Pay with PayPal...",
    "description": "Comments:I've had an overall good experience with PayPal. It's made my life easier.",
    "date": "4 weeks ago\n  \n    New",
    "rating": 4,
    "pros": "I Iike that I'm able to cash out my virtual Visa cards and pay online fast",
    "cons": "I don't like that your account can be limited at any time for no reason."
  },
  {
    "title": "Paypal is easy",
    "description": "Comments:I've not had any issues with this software",
    "date": "3 weeks ago\n  \n    New",
    "rating": 5,
    "pros": "It is easy to pay for things using paypal",
    "cons": "I find it very straightforward to log in and pay"
  },
  {
    "title": "My experience with Paypal billing tool as a consumer",
    "description": "Comments:I have been utilizing PayPal as my primary billing tool for several months now, and I must say that it has significantly streamlined my online transactions.   Overall, I find PayPal essential for managing my billing needs for business-related financial management.",
    "date": "last month\n  \n    New",
    "rating": 5,
    "pros": "The user interface is intuitive, making it easy to navigate through the various features. Additionally, PayPal's integration with other platforms enhances its functionality and overall convenience.",
    "cons": "There have been moments when customer service response times were slower than expected."
  },
  {
    "title": "Great overall, with little room for improvement.",
    "description": "Comments:Overall I really like PayPal and am nit-picking to find things I like least. Overall it's been great both personally and professionally.",
    "date": "3 months ago",
    "rating": 4,
    "pros": "I like having a debit card specific to this, because that's where I store our businesses funds like a checking account. I like the ability to create and accept payments for invoices. I also like that I can use PayPal for personal transactions just like Venmo or Zelle.",
    "cons": "I wish their UI were better. Certain features seem challenging to find or access. Specifically the add a payment or add money feature. I wish they'd use intelligence to learn what I use most and bring that to the front of the dashboard."
  },
  {
    "title": "Paypal is the standard by which all payment processing is measured.",
    "description": "Comments:Paypal is an all in one solution enabling credit, debit, paypal, venmo, apple pay and google pay.",
    "date": "3 months ago",
    "rating": 5,
    "pros": "The brand recognition is huge! So many people use or at least know of paypal that offering it increases consumer confidence.",
    "cons": "Some of the company policies and practices do not line up with ours."
  },
  {
    "title": "Paypal is horrible",
    "description": "Comments:Very horrible and theyre the worst pay company ive ever had the displeasure of dealing with. Their ceo is a fake and liar too.",
    "date": "11 months ago",
    "rating": 1,
    "pros": "I like that they atleast guve you screenshot able evidence so later i have the proof on court even if they delete the account.",
    "cons": "They steal money and hold business funds under the guise of security but allow money laundering by other means for non-vetted accounts while they punish the business ones."
  },
  {
    "title": "Payments made easy with PayPal",
    "description": "Comments:PayPal provides secure transactions, convenience, and excellent buyer protection, ensuring a satisfying experience for online purchases and transactions.",
    "date": "11 months ago",
    "rating": 5,
    "pros": "It's widely accepted online and offers buyer and seller protection.",
    "cons": "PayPal sometimes charges fees \nfor certain transactions and  Occasionally freezes accounts"
  },
  {
    "title": "Convenient and time-saving!",
    "description": "Comments:I enjoy the convenience and time-saving feature while checking out with online retailers, but I typically will use Venmo to send/receive money with friends and family - I used PayPal for that in the past. As long as my account stays secure, I will continue to use PayPal.",
    "date": "4 months ago",
    "rating": 4,
    "pros": "I absolutely love the option to checkout with online retailers by using PayPal. The convenience of not having to type in my credit card number is the best feature in my opinion.",
    "cons": "A couple years ago, my PayPal account was hacked into. I received an email that an online virtual bakery was opened with my account. Terrified, I contacted PayPal and demanded they close my account. They refused and stated that the business that was registered to my account was deleted, and it would never happen again. Being that PayPal is connected to my bank and my credit card, I was mortified that security was not strong enough to keep someone from hacking into it."
  },
  {
    "title": "Pay Pal  Business",
    "description": "Comments:My overall experience with pay pal is excellent it has given me the freedom to send money to my family, to invoice a customer from another city or state and receive money in minutes. It is a very reliable system and I recommend pay pal to any one it is awesome all for businesses worldwide.",
    "date": "6 months ago",
    "rating": 5,
    "pros": "I love using pay pal privately with a customer or online shopping it give me the comfort to make payments create invoices for clients send or receive money from friends and family. Pay Pal is a great way to do business world wide.",
    "cons": "There's not much I don't like about pay pal they are very punctual reliable and you get your payments on time . It lets you know every detail and transaction you have made pay pal is a great way to receive and send money."
  },
  {
    "title": "PayPal-It's Been a Long Great Trip",
    "description": "Comments:Since 2006, both PayPal and my business have gone through changes, and both of us have had good and bad changes. PayPal has changed for the good (so have I, but this is not about me) and sometimes it is a hassle to learn these changes but that is just part of the business. \nOverall, like any long-term relationship, there are ups and downs; luckily for me, the downs are short, and the u[ps are long.",
    "date": "3 months ago",
    "rating": 5,
    "pros": "Reliability is at the top of the list. PayPal as been around as long as I've been doing business online.",
    "cons": "Listing something of a Con with PayPal is difficult because everything I think of turns out to be 'operator error' and has little to do with PayPal itself. I am sure there are negative points to any system that holds onto your funds, but so far (since 2006), I have not encountered any. <knocks on wood>"
  },
  {
    "title": "i really liked my paypal experience",
    "description": "Comments:As a user of PayPal for nearly eight years, I concluded that it maintains the security and confidentiality of user data, and there is no room for anyone to scamming the other, which increases the trust of customers, and I personally recommend it to everyone I know",
    "date": "8 months ago",
    "rating": 5,
    "pros": "What I like a most about PayPal is that it is easy to use and more than that our data is safe and protected",
    "cons": "Frankly, so far I have not faced any problem, so there are no negatives that I have about PayPal"
  },
  {
    "title": "PayPal refuses to close my account",
    "description": "Comments:I have been a user for 13 yrs, but I want to close my account  --- PayPal refuses to do this!  I had a bad experience with a $754.00 charge from LinkedIn for 1 yr of Prime service, but I cancelled it within 28 days, and there was supposed to be no charge.  LinkedIn billed me anyway, and when I put in a complaint to PayPal they told me I still had to pay them.  I then appealed to PayPal, then they told me their protection from fraud in this case was not covered!!  Whaat??  LinkedIn finally gave me a $754.00 credit, so my account has a ZERO balance, so I again asked to close my account ---- then they told me I couldn't because I had a Honey PayPal (I never applied for this, nor did I ever receive any rewards or points on this), so I contacted Honey and they cancelled this so-called account I had.  PayPal still refused to close my account, even though I sent the details of the LinkedIn credit and the fact that they billed me in error.  Now PayPal tells me they need to \"verify\" my identity.  They already have my name, address, bank account number, e-mail.  They are demanding I send them ID such as my Driver's license, Passport, credit card bill, Federal tax # (doesn't exist in Canada I told them), or they refuse to cancel my account.  I told them they never asked for this when I opened my account, why do they need this to close my account -- no answer.  I am not sending them any personal credit details, have they not heard of \"identity fraud?\"  They have refused me to escalate to a Manager, refused me their e-mail address, mailing address, and I feel like I am being black-mailed.  If they try t charge me non-use fees I will not pay them. I was forced to contact the Consumer Protection Agency in Canada to file a formal complaint against them.  Moral of story --- DO NOT USE PAYPAL, find another way to pay for your goods!",
    "date": "7 months ago",
    "rating": 1,
    "pros": "PayPal used to have good customer service, but not anymore.  They have subbed it out to the Philippines, and they don't care about you at all.  Sometimes I can't even understand what they are saying.",
    "cons": "I don't like their fees for non-use for 1 year. They charge you a penalty if you don't use your PayPal after 1 year.  They also charge a lot for exchange on money currencies."
  },
  {
    "title": "PayPal helps keep my business runng.",
    "description": "",
    "date": "7 months ago",
    "rating": 5,
    "pros": "Running my business with PayPal has been a game-changer. It's smooth, secure, and makes everything from sending invoices to receiving payments a breeze.\n\nSetting up the account was a walk in the park, and integrating it with my existing system took no time at all. The interface is super user-friendly, so even if you're not a tech whiz, you'll be navigating it like a pro in no time.\n\nSecurity is a major concern for any business dealing with online transactions, and PayPal definitely delivers. Their advanced features put my mind at ease, knowing both my business and my clients are protected.  Honestly, I've never had any issues with fraud, which is a huge weight off my shoulders.\n\nAnother perk I love is the ability to access my funds quickly. With PayPal's instant transfer options, I can get my money when I need it, keeping my cash flow healthy and my business running smoothly.\n\nThe customer service is top-notch too. The few times I've needed help, their team has been incredibly responsive, helpful, and professional. It's a great feeling knowing they're there if I ever run into anything.\n\nAll in all, if you're looking for a reliable, secure, and user-friendly payment solution for your business,  I can't recommend PayPal enough. My experience has been fantastic, and I'm sure you'll be happy with it too",
    "cons": "Sometimes I have a difficult time locating things that I want.  This very well may not be PayPal, but me."
  },
  {
    "title": "This Company is Commiting Insider Fraud and Scams From the Fraud Department",
    "description": "Comments:Without a doubt, PayPal Credit's Fraud Department is behind the mass scams going on with clients' accounts. Just like most of the others who have left feedback, money has come up missing, and I caught them lying about it from the beginning. I put money into an online wallet, which they returned within two hours; I hadn't bought anything with it, and it was simply for future work. I confronted them right away about the missing money in August, and they said I had reported it as fraud, which was a complete lie. I have proof. I immediately said that I never claimed it was fraud; someone at PayPal Credit did. I began to ask for proof of me reporting it as fraud because I could have withdrawn it. That's when they admitted on three occasions that someone from the Fraud Department performed the return. Then, they would claim I did, then they would claim they did. Now again, they are claiming I did and had bought something with it. However, I don't believe they contacted the company because you don't purchase when you put money in the wallet. You add money to your wallet and then decide to purchase, so what they were saying didn't add up. The other company provided a refund number, saying they refunded it right away in August. I have eight official letters from them confirming it was returned, and PayPal Credit is falsely claiming they didn't and kept it for products I received, which is not true at all. The way they described why they kept the money doesn't make sense in terms of how this company does business. They kept telling me to talk to the other company, sending me in circles. Not to mention, I never requested the money to be returned; the PayPal Credit Fraud Department did, and now it's lost. I shouldn't be responsible for it; they initiated it. I have official correspondence where I'm telling the company I never requested the money be taken out of my wallet in August. Come to October 7, 2023, they had made a new account and forwarded the $1,227.00, making me pay for it. It's crazy how the money I caught them lying about ended up missing and, months later, was forwarded to my account. Now, they are making me pay for something they did in the first place. Not only do I have to pay for the missing money that they returned, but now they are also making me pay interest on it. I filed official police reports and contacted the Better Business Bureau. The Fraud Department is pocketing all this money; it's clear to see, with all these similar stories of PayPal Credit creating new accounts without clients' permission or knowledge, forwarding balances, pretending not to understand anything you're saying, spinning you in circles, and making up stuff that doesn't make sense. Too many of us are experiencing money just disappearing. It's going somewhere into someone's pocket, which isn't fair to us as consumers. Be very aware of the scams and fraud being committed by them and use caution.",
    "date": "10 months ago",
    "rating": 1,
    "pros": "Nothing at all anymore because they are untrustworthy.",
    "cons": "They are stealing mass consumers money. \nThey will create new accounts and request for your money to be returned without permission, then say you did it, then the money will come up 100% missing, after they were caught lying in the first place. \nThey will then make you pay back the money, that they clearly stole from you back and interest too."
  },
  {
    "title": "What I Know About PayPal Payment Gateway",
    "description": "",
    "date": "4 months ago",
    "rating": 5,
    "pros": "PayPal allows me to send and receive payments instantly from any corner of the globe.\nThe best part is that it allows users without account to make payments outside PP through credit cards.",
    "cons": "My account was limited late last year but it was reinstated after a long debate with customer support."
  },
  {
    "title": "PayPal makes payments easy",
    "description": "Comments:Overall I am really pleased with PayPal. It has helped me resolve disputes with customers and provides a sense of confidence for consumers.",
    "date": "last month\n  \n    New",
    "rating": 5,
    "pros": "PayPal is a great platform for consumers and businesses. It gives people the confidence of a secure platform for transactions. It's new and updated escalation procedures also make it easy for customers to dispute payments,",
    "cons": "One of the cons I have found with PayPal is that it is no longer possible to make collections without a fee. This was a useful tool in our office when we were doing a present for someone in the office."
  },
  {
    "title": "Tye's PayPal review",
    "description": "Comments:Easy to use, great for collecting or distributing payments.",
    "date": "10 months ago",
    "rating": 5,
    "pros": "I like the nice looking UI \nI like that it's very user-friendly\nI like that it processes transactions instantly\nI like that it's easy to find people you frequently do business with and send or request money quickly",
    "cons": "I don't like the high transactions fees on small transactions, trying to send your friend a dollar can cost upwards of $5 sometimes its ridiculous\nI don't like how sometimes it can take a week for debit/credit purchases to process"
  },
  {
    "title": "Why Pay with PayPal",
    "description": "",
    "date": "3 months ago",
    "rating": 5,
    "pros": "PayPal protect sellers and buyers against fraud which is one of the best aspects so far.\nAdditionally, PayPal charging fee is friendly compared to alternatives such as Payoneer.",
    "cons": "I 💯 % lack any aspect which I can term as a flaw at the moment."
  },
  {
    "title": "Reliable and convenient tool for handling both personal and business transactions",
    "description": "Comments:PayPal has been a reliable and convenient tool for handling both personal and business transactions. While the fees can add up in some cases, its security features and ease of use make it a top choice for online payments.",
    "date": "2 months ago",
    "rating": 5,
    "pros": "Convenience and extensive acceptance. PayPal allows me to make purchases, send money, and receive payments quickly, both domestically and internationally. Its buyer and seller protection policies offer a sense of security, especially for online transactions. The platform’s integration with various websites and apps is seamless, making it easy to use almost anywhere.",
    "cons": "Fees associated with certain types of transactions, especially for currency conversion and receiving business payments. Additionally, the customer service experience can sometimes be slow or challenging to navigate if there are account or payment issues."
  },
  {
    "title": "Use paypal for an easy and effective payment solution!",
    "description": "Comments:Paypal makes making and recieving payments an absolute breeze, and its smart features make life so easy!",
    "date": "2 months ago\n  \n    New",
    "rating": 5,
    "pros": "Paypal offers a seamless and easy payment processing platform that helps life run more smoothly.",
    "cons": "I have had no issues with paypal in my time using it."
  },
  {
    "title": "Paypal's lack of transparency and efficient communication makes it a risky option as a financial provider.",
    "description": "Comments:Paypal places many barriers between the customer and vital information making my overall experience very frustrating. This is made even more inconvenient by the lack of online support making it difficult to reach the right people when a problem arises. Paypal has caused numerous disruptions in my financial well being due to these issues.",
    "date": "last month\n  \n    New",
    "rating": 2,
    "pros": "Paypal is widely accepted as a payment option for online transactions, making it a convenient payment option when shopping online.",
    "cons": "Lack of account transparency such as the ability to view declined transactions. Additionally, the lack of easily accessible online support like many other payment providers offer as their digital experience. There does not seem to be any explanation as to why users are unable to view declined transactions and where the charge is coming from. This is extremely inconvenient and is potentially a security risk as monitoring all transactions towards any funding account is essential for monitoring unusual activity."
  },
  {
    "title": "PayPal review",
    "description": "Comments:My experience with PayPal has been mostly positive. It’s convenient for online shopping, sending money, and receiving payments. The user interface is simple, and transactions are generally fast and secure, which I appreciate. However, the high fees, especially with currency conversion or business transactions, can be a downside. Additionally, the occasional hold on funds can be frustrating when I need quick access to money. Despite these issues, PayPal remains a reliable option for online payments.",
    "date": "3 months ago",
    "rating": 5,
    "pros": "PayPal is very user friendly. I like how PayPal makes online payments so simple and secure. It’s convenient for both personal transactions and business, with the ability to link bank accounts or cards and pay without exposing financial information. The buyer protection is a nice safety net too, and it integrates with tons of websites and apps.",
    "cons": "What I like least about PayPal is the high fees, especially when converting currencies or handling business transactions. It also holds funds sometimes for extended periods, which can be frustrating if you need quick access to your money."
  },
  {
    "title": "PayPal-Big things come in small packages.",
    "description": "Comments:My overall experience is quit good with PayPal. I've been using them for 20 years. They have been number one go to for sending and receiving money before Cashapp and Venmo were ever around. I still use PayPal for online sales and big transactions because to me they are the most reliable and easy to access past payments received and sent, very organized. One of my favorite things is being able to send professional invoices to clients.",
    "date": "3 weeks ago\n  \n    New",
    "rating": 4,
    "pros": "I like how PayPal creates an easy user experience.",
    "cons": "What I like least about PayPal is the high transaction fee and per transaction fee for sending and receiving."
  },
  {
    "title": "paypal ... good until it isnt",
    "description": "Comments:for the majority of the time i found it extremely effective in money management",
    "date": "4 weeks ago\n  \n    New",
    "rating": 5,
    "pros": "i liked the fact you can send invoices , send payments to visa direct or venmo and accept swipe paymemts as well",
    "cons": "the security is great however it lacks unatuomated overides from custmer service representatives and inforces verification protocols that cant be addressed by sparsly available cusotmer service"
  },
  {
    "title": "My review about PayPal and what I love about it",
    "description": "Comments:PayPal is really good and I can always use it to put my money on my HSBC debit card.",
    "date": "4 weeks ago\n  \n    New",
    "rating": 5,
    "pros": "PayPal is something you can use to withdraw your money into your bank. You can also use PayPal to buy stuff on eBay as well and you can also use PayPal to add money.",
    "cons": "It can sometimes give me errors and it logs me out automatically for no reason."
  },
  {
    "title": "Pay with PayPal...",
    "description": "Comments:I've had an overall good experience with PayPal. It's made my life easier.",
    "date": "4 weeks ago\n  \n    New",
    "rating": 4,
    "pros": "I Iike that I'm able to cash out my virtual Visa cards and pay online fast",
    "cons": "I don't like that your account can be limited at any time for no reason."
  },
  {
    "title": "Paypal is easy",
    "description": "Comments:I've not had any issues with this software",
    "date": "3 weeks ago\n  \n    New",
    "rating": 5,
    "pros": "It is easy to pay for things using paypal",
    "cons": "I find it very straightforward to log in and pay"
  },
  {
    "title": "My experience with Paypal billing tool as a consumer",
    "description": "Comments:I have been utilizing PayPal as my primary billing tool for several months now, and I must say that it has significantly streamlined my online transactions.   Overall, I find PayPal essential for managing my billing needs for business-related financial management.",
    "date": "last month\n  \n    New",
    "rating": 5,
    "pros": "The user interface is intuitive, making it easy to navigate through the various features. Additionally, PayPal's integration with other platforms enhances its functionality and overall convenience.",
    "cons": "There have been moments when customer service response times were slower than expected."
  },
  {
    "title": "Great overall, with little room for improvement.",
    "description": "Comments:Overall I really like PayPal and am nit-picking to find things I like least. Overall it's been great both personally and professionally.",
    "date": "3 months ago",
    "rating": 4,
    "pros": "I like having a debit card specific to this, because that's where I store our businesses funds like a checking account. I like the ability to create and accept payments for invoices. I also like that I can use PayPal for personal transactions just like Venmo or Zelle.",
    "cons": "I wish their UI were better. Certain features seem challenging to find or access. Specifically the add a payment or add money feature. I wish they'd use intelligence to learn what I use most and bring that to the front of the dashboard."
  },
  {
    "title": "Paypal is the standard by which all payment processing is measured.",
    "description": "Comments:Paypal is an all in one solution enabling credit, debit, paypal, venmo, apple pay and google pay.",
    "date": "3 months ago",
    "rating": 5,
    "pros": "The brand recognition is huge! So many people use or at least know of paypal that offering it increases consumer confidence.",
    "cons": "Some of the company policies and practices do not line up with ours."
  },
  {
    "title": "Paypal is horrible",
    "description": "Comments:Very horrible and theyre the worst pay company ive ever had the displeasure of dealing with. Their ceo is a fake and liar too.",
    "date": "11 months ago",
    "rating": 1,
    "pros": "I like that they atleast guve you screenshot able evidence so later i have the proof on court even if they delete the account.",
    "cons": "They steal money and hold business funds under the guise of security but allow money laundering by other means for non-vetted accounts while they punish the business ones."
  },
  {
    "title": "Payments made easy with PayPal",
    "description": "Comments:PayPal provides secure transactions, convenience, and excellent buyer protection, ensuring a satisfying experience for online purchases and transactions.",
    "date": "11 months ago",
    "rating": 5,
    "pros": "It's widely accepted online and offers buyer and seller protection.",
    "cons": "PayPal sometimes charges fees \nfor certain transactions and  Occasionally freezes accounts"
  },
  {
    "title": "Convenient and time-saving!",
    "description": "Comments:I enjoy the convenience and time-saving feature while checking out with online retailers, but I typically will use Venmo to send/receive money with friends and family - I used PayPal for that in the past. As long as my account stays secure, I will continue to use PayPal.",
    "date": "4 months ago",
    "rating": 4,
    "pros": "I absolutely love the option to checkout with online retailers by using PayPal. The convenience of not having to type in my credit card number is the best feature in my opinion.",
    "cons": "A couple years ago, my PayPal account was hacked into. I received an email that an online virtual bakery was opened with my account. Terrified, I contacted PayPal and demanded they close my account. They refused and stated that the business that was registered to my account was deleted, and it would never happen again. Being that PayPal is connected to my bank and my credit card, I was mortified that security was not strong enough to keep someone from hacking into it."
  },
  {
    "title": "Pay Pal  Business",
    "description": "Comments:My overall experience with pay pal is excellent it has given me the freedom to send money to my family, to invoice a customer from another city or state and receive money in minutes. It is a very reliable system and I recommend pay pal to any one it is awesome all for businesses worldwide.",
    "date": "6 months ago",
    "rating": 5,
    "pros": "I love using pay pal privately with a customer or online shopping it give me the comfort to make payments create invoices for clients send or receive money from friends and family. Pay Pal is a great way to do business world wide.",
    "cons": "There's not much I don't like about pay pal they are very punctual reliable and you get your payments on time . It lets you know every detail and transaction you have made pay pal is a great way to receive and send money."
  },
  {
    "title": "PayPal-It's Been a Long Great Trip",
    "description": "Comments:Since 2006, both PayPal and my business have gone through changes, and both of us have had good and bad changes. PayPal has changed for the good (so have I, but this is not about me) and sometimes it is a hassle to learn these changes but that is just part of the business. \nOverall, like any long-term relationship, there are ups and downs; luckily for me, the downs are short, and the u[ps are long.",
    "date": "3 months ago",
    "rating": 5,
    "pros": "Reliability is at the top of the list. PayPal as been around as long as I've been doing business online.",
    "cons": "Listing something of a Con with PayPal is difficult because everything I think of turns out to be 'operator error' and has little to do with PayPal itself. I am sure there are negative points to any system that holds onto your funds, but so far (since 2006), I have not encountered any. <knocks on wood>"
  },
  {
    "title": "i really liked my paypal experience",
    "description": "Comments:As a user of PayPal for nearly eight years, I concluded that it maintains the security and confidentiality of user data, and there is no room for anyone to scamming the other, which increases the trust of customers, and I personally recommend it to everyone I know",
    "date": "8 months ago",
    "rating": 5,
    "pros": "What I like a most about PayPal is that it is easy to use and more than that our data is safe and protected",
    "cons": "Frankly, so far I have not faced any problem, so there are no negatives that I have about PayPal"
  },
  {
    "title": "PayPal refuses to close my account",
    "description": "Comments:I have been a user for 13 yrs, but I want to close my account  --- PayPal refuses to do this!  I had a bad experience with a $754.00 charge from LinkedIn for 1 yr of Prime service, but I cancelled it within 28 days, and there was supposed to be no charge.  LinkedIn billed me anyway, and when I put in a complaint to PayPal they told me I still had to pay them.  I then appealed to PayPal, then they told me their protection from fraud in this case was not covered!!  Whaat??  LinkedIn finally gave me a $754.00 credit, so my account has a ZERO balance, so I again asked to close my account ---- then they told me I couldn't because I had a Honey PayPal (I never applied for this, nor did I ever receive any rewards or points on this), so I contacted Honey and they cancelled this so-called account I had.  PayPal still refused to close my account, even though I sent the details of the LinkedIn credit and the fact that they billed me in error.  Now PayPal tells me they need to \"verify\" my identity.  They already have my name, address, bank account number, e-mail.  They are demanding I send them ID such as my Driver's license, Passport, credit card bill, Federal tax # (doesn't exist in Canada I told them), or they refuse to cancel my account.  I told them they never asked for this when I opened my account, why do they need this to close my account -- no answer.  I am not sending them any personal credit details, have they not heard of \"identity fraud?\"  They have refused me to escalate to a Manager, refused me their e-mail address, mailing address, and I feel like I am being black-mailed.  If they try t charge me non-use fees I will not pay them. I was forced to contact the Consumer Protection Agency in Canada to file a formal complaint against them.  Moral of story --- DO NOT USE PAYPAL, find another way to pay for your goods!",
    "date": "7 months ago",
    "rating": 1,
    "pros": "PayPal used to have good customer service, but not anymore.  They have subbed it out to the Philippines, and they don't care about you at all.  Sometimes I can't even understand what they are saying.",
    "cons": "I don't like their fees for non-use for 1 year. They charge you a penalty if you don't use your PayPal after 1 year.  They also charge a lot for exchange on money currencies."
  },
  {
    "title": "PayPal helps keep my business runng.",
    "description": "",
    "date": "7 months ago",
    "rating": 5,
    "pros": "Running my business with PayPal has been a game-changer. It's smooth, secure, and makes everything from sending invoices to receiving payments a breeze.\n\nSetting up the account was a walk in the park, and integrating it with my existing system took no time at all. The interface is super user-friendly, so even if you're not a tech whiz, you'll be navigating it like a pro in no time.\n\nSecurity is a major concern for any business dealing with online transactions, and PayPal definitely delivers. Their advanced features put my mind at ease, knowing both my business and my clients are protected.  Honestly, I've never had any issues with fraud, which is a huge weight off my shoulders.\n\nAnother perk I love is the ability to access my funds quickly. With PayPal's instant transfer options, I can get my money when I need it, keeping my cash flow healthy and my business running smoothly.\n\nThe customer service is top-notch too. The few times I've needed help, their team has been incredibly responsive, helpful, and professional. It's a great feeling knowing they're there if I ever run into anything.\n\nAll in all, if you're looking for a reliable, secure, and user-friendly payment solution for your business,  I can't recommend PayPal enough. My experience has been fantastic, and I'm sure you'll be happy with it too",
    "cons": "Sometimes I have a difficult time locating things that I want.  This very well may not be PayPal, but me."
  },
  {
    "title": "This Company is Commiting Insider Fraud and Scams From the Fraud Department",
    "description": "Comments:Without a doubt, PayPal Credit's Fraud Department is behind the mass scams going on with clients' accounts. Just like most of the others who have left feedback, money has come up missing, and I caught them lying about it from the beginning. I put money into an online wallet, which they returned within two hours; I hadn't bought anything with it, and it was simply for future work. I confronted them right away about the missing money in August, and they said I had reported it as fraud, which was a complete lie. I have proof. I immediately said that I never claimed it was fraud; someone at PayPal Credit did. I began to ask for proof of me reporting it as fraud because I could have withdrawn it. That's when they admitted on three occasions that someone from the Fraud Department performed the return. Then, they would claim I did, then they would claim they did. Now again, they are claiming I did and had bought something with it. However, I don't believe they contacted the company because you don't purchase when you put money in the wallet. You add money to your wallet and then decide to purchase, so what they were saying didn't add up. The other company provided a refund number, saying they refunded it right away in August. I have eight official letters from them confirming it was returned, and PayPal Credit is falsely claiming they didn't and kept it for products I received, which is not true at all. The way they described why they kept the money doesn't make sense in terms of how this company does business. They kept telling me to talk to the other company, sending me in circles. Not to mention, I never requested the money to be returned; the PayPal Credit Fraud Department did, and now it's lost. I shouldn't be responsible for it; they initiated it. I have official correspondence where I'm telling the company I never requested the money be taken out of my wallet in August. Come to October 7, 2023, they had made a new account and forwarded the $1,227.00, making me pay for it. It's crazy how the money I caught them lying about ended up missing and, months later, was forwarded to my account. Now, they are making me pay for something they did in the first place. Not only do I have to pay for the missing money that they returned, but now they are also making me pay interest on it. I filed official police reports and contacted the Better Business Bureau. The Fraud Department is pocketing all this money; it's clear to see, with all these similar stories of PayPal Credit creating new accounts without clients' permission or knowledge, forwarding balances, pretending not to understand anything you're saying, spinning you in circles, and making up stuff that doesn't make sense. Too many of us are experiencing money just disappearing. It's going somewhere into someone's pocket, which isn't fair to us as consumers. Be very aware of the scams and fraud being committed by them and use caution.",
    "date": "10 months ago",
    "rating": 1,
    "pros": "Nothing at all anymore because they are untrustworthy.",
    "cons": "They are stealing mass consumers money. \nThey will create new accounts and request for your money to be returned without permission, then say you did it, then the money will come up 100% missing, after they were caught lying in the first place. \nThey will then make you pay back the money, that they clearly stole from you back and interest too."
  },
  {
    "title": "What I Know About PayPal Payment Gateway",
    "description": "",
    "date": "4 months ago",
    "rating": 5,
    "pros": "PayPal allows me to send and receive payments instantly from any corner of the globe.\nThe best part is that it allows users without account to make payments outside PP through credit cards.",
    "cons": "My account was limited late last year but it was reinstated after a long debate with customer support."
  },
  {
    "title": "PayPal makes payments easy",
    "description": "Comments:Overall I am really pleased with PayPal. It has helped me resolve disputes with customers and provides a sense of confidence for consumers.",
    "date": "last month\n  \n    New",
    "rating": 5,
    "pros": "PayPal is a great platform for consumers and businesses. It gives people the confidence of a secure platform for transactions. It's new and updated escalation procedures also make it easy for customers to dispute payments,",
    "cons": "One of the cons I have found with PayPal is that it is no longer possible to make collections without a fee. This was a useful tool in our office when we were doing a present for someone in the office."
  },
  {
    "title": "Tye's PayPal review",
    "description": "Comments:Easy to use, great for collecting or distributing payments.",
    "date": "10 months ago",
    "rating": 5,
    "pros": "I like the nice looking UI \nI like that it's very user-friendly\nI like that it processes transactions instantly\nI like that it's easy to find people you frequently do business with and send or request money quickly",
    "cons": "I don't like the high transactions fees on small transactions, trying to send your friend a dollar can cost upwards of $5 sometimes its ridiculous\nI don't like how sometimes it can take a week for debit/credit purchases to process"
  },
  {
    "title": "Why Pay with PayPal",
    "description": "",
    "date": "3 months ago",
    "rating": 5,
    "pros": "PayPal protect sellers and buyers against fraud which is one of the best aspects so far.\nAdditionally, PayPal charging fee is friendly compared to alternatives such as Payoneer.",
    "cons": "I 💯 % lack any aspect which I can term as a flaw at the moment."
  }
]