[
  {
    "title": "\"Great Software\"",
    "description": "What do you like best about Performio?Performio is a great software which has everything you need as an Account Manager to manage your workload. You can access your workload, your monthly/yearly target, results. It talks to Salesforce and any changes you make to the dollar value in an account in Salesforce is refelected in Performio. You can also see any incentives/competitions the company is running for its employees and how you are performing agains the targets. I've never had to contact our IT team for any issues and I've never seen it down. I use this everyday. What do you dislike about Performio?The changes you make in an account in Salesforce don't reflect in Performio until the next day and sometimes longer. Would be a lot beneficial if this can be reduced to a couple of hours. What problems is Performio solving and how is that benefiting you?Performio helps me manage my workload, my monthly/yearly target and results. It talks to Salesforce and any changes you make to the dollar value in an account in Salesforce is refelected in Performio. I can also see how I'm performing against any incentives/competitions the company is running. At the end of each month you can access your commission statements and when you'll be paid. ",
    "date": "2024-12-12T00:00:00.000Z",
    "rating": 4,
    "reviewerName": "Manu R."
  },
  {
    "title": "\"Performio Sales Commissions & Management Software and Team are Best in the World!!!\"",
    "description": "What do you like best about Performio?Performio is very intuitive and easy to use and can be transformed to the specifications of your commissions needs (ease of implementation). We use Performio every day and the ease of integration between all our systems is flawless. We love all the features and look forward to work with the team on implementing more advanced features (ie. AI capabilities). The best thing about Performio is the team itself. The Performio team is very responsive to our needs and questions and work closely with us to resolve any issues. We truly appreciate and are thankful for this partnership with Performio. What do you dislike about Performio?Very few users have had a negative opinion on the product. The only downside that we have heard is maybe the mobile app can be more functional to fit their needs. But overall the positives greatly outweigh any negatives. What problems is Performio solving and how is that benefiting you?Before using Performio the monthly commissions process was handled by various ERP software together with spreadsheets and the process took 10+ days. Now with Performio handling the bulk of processing duties, the closing process has been cut to 1-2 days. It definitely has saved us a great deal of time that we can now devote to improving other areas. ",
    "date": "2024-12-12T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Angelo I."
  },
  {
    "title": "\"Essential Platform\"",
    "description": "What do you like best about Performio?As a top user of Performio, I rely heavily on it to track my sales commissions. The platform has been crucial  to my success as a salesperson. Very intuitive...allowing me to monitor my performance metrics and earnings in real-time. I appreciate easy the system is—having a clear breakdown of my commissions helps me stay motivated and identify areas where I can work harder.\n\nOne of the best features is the reporting functionality, which provides detailed insights without requiring difficult setup. This saves me time and keeps everything organized. I’ve found Performio to be reliable, with minimal downtime or glitches, which is crucial since I track commissions consistently.\n\nIn summary, Performio is an essential part of my workflow. Its ease of use and dependability make it an excellent tool for anyone serious about tracking their sales commissions accurately and efficiently. What do you dislike about Performio?There’s always room for improvement. Occasionally, I’ve noticed small delays in updates, which can be frustrating when waiting for the most up to date numbers. However, these instances are rare and don’t detract much from the overall experience. What problems is Performio solving and how is that benefiting you?Tracking my sales commisions. ",
    "date": "2024-12-12T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Brett R."
  },
  {
    "title": "\"Performance under control\"",
    "description": "What do you like best about Performio?Immediate Login by Login SSO without need of user/password . You can easly look at actual commission details and at once to one of month before. Excel feature is useful and GP trend graphic too. I generally like the graphic design - color/layout. I use it about once/twice per week and  mainly in the last week of the month to double check final data. So far no need of assistance / customer support so I can not review. Good ease of implementation and integration with our internal software. No issue or discrepancies at all. What do you dislike about Performio?Adjustment request function- never used so far . But I  can understand it should be there for any discrepancy could occur. In the #Sales tab I don't like you can't freeze header while scrolling down. What problems is Performio solving and how is that benefiting you?Clearly tracking and monitoring commissions,relative sales compensation and performance vs budget. ",
    "date": "2024-12-18T00:00:00.000Z",
    "rating": 4,
    "reviewerName": "sabrina D."
  },
  {
    "title": "\"Performio works, but can be slow and confusing to learn\"",
    "description": "What do you like best about Performio?I like that it compiles all my client information that I need to see my commission as well as the information I need to know what clients are causing charge backs so I can get the money in as fast as possible What do you dislike about Performio?It can be confusing when disputing charge backs and confirming that any disputes have been approved. Sometimes is takes over a day for the system to load updates so it's hard to be sure that the commission is there. Also, a lot of months, there is a very short window to get disputes in. We've expereiced less than 24 hour windows and it's just unrealistic. What problems is Performio solving and how is that benefiting you?It helps me ensure that I am getting all the commission I am owed. It also helps with getting payments from clients to avoid charge backs ",
    "date": "2024-12-12T00:00:00.000Z",
    "rating": 3,
    "reviewerName": "Amanda F."
  },
  {
    "title": "\"Great Way To Monitor My Commissions!\"",
    "description": "What do you like best about Performio?Performio gives me a clear and concise way to navigate through all my deals, confirm that each one is in the system correctly, and check that each one will pay the way it should.  Not to mention being able to see how my commission is pacing against my draw!  In a job like mine, I always have many balls in the air, and being able to see them all at once is very important to help ensure that deals don't get forgotten about, not entered, and in the end not paid!  It doesn't do anyone any good to leave money on the table! What do you dislike about Performio?It took a little getting used to, there is a pretty steep learning curve.  There is a lot going on, it monitors a lot of data, and it's a little daunting at first glance. Recommendations to others considering Performio:Find someone you work with to show you the ropes of how to use it.  Be patient with yourself, it will take some getting used to, but you'll get there!  Keeping an accurate record of your sales is imperative, and using this to check against it is key to ensuring you don't leave any orders on the table. What problems is Performio solving and how is that benefiting you?Being able to see how my commission is about to be calculated allows me to catch errors before they affect me directly.  Often times, when things don't look the way they should, I still have plenty of time to make corrections and not have a problem that I would have experienced otherwise. ",
    "date": "2024-10-28T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Leo W."
  },
  {
    "title": "\"Straightforward, direct and platform versatility\"",
    "description": "What do you like best about Performio?It worked from the word go unlike many other platforms where we often face complexities, especially with logging in due to oragnisational walls and network restrictions. The information is presented in very readable and support for tables and charts layout is handy to represent quick view on progress and achievements. Its ability to export custom data reports not only works well but very handy to share selected information with peers. Lastly, its cross platform ability is super conveninent to access on the go. I use its app everyday on iPhone and iPad in addition to Laptop and Desktop. While I dont handle background customisation at my work, the changes pushed by respective team show up without delays is a big green tick to the platforms integration and process reliability. What do you dislike about Performio?My only feedback would be to improve its login PIN UI and look into implementing faceID and TouchID which will not only improve security but will also increase the easy of access. What problems is Performio solving and how is that benefiting you?It acts as one stop destination to access my teams performance and in identifying gaps that we need to work on. ",
    "date": "2024-10-18T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Rahul N."
  },
  {
    "title": "\"Easy to use and navigate!!\"",
    "description": "What do you like best about Performio?I find performio very easy to use and navigate. I check performio every day  and it allows for me to easily track my monhly sales & KPI's so I know what I have to strive for to achieve my monthly targets. Being a new starter with my company gaining access to my performio account was an easy process. I have also found it very quick and easy when contacting customer support for things such as a password reset. What do you dislike about Performio?I think that something that could be improved with performio would be the overall look. It's function and ease of use are there but the overall look of performio is very bland. What problems is Performio solving and how is that benefiting you?Performio makes it easy to track sales targets, goals and commision all in one place. It solves the issue of looking in multiple places and following up sales with manager and allows for you to efficiently manage your own performance. ",
    "date": "2024-10-17T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Nyree S."
  },
  {
    "title": "\"Performio is a must have for Sales Executives!\"",
    "description": "What do you like best about Performio?I rely on Performio to see what my commissions will be each and every month.  Performio keeps track of my sales and is a reliable source to see my commissions. Each month, we are told that our commissions are loaded up in Performio. We have a certain time period to make adjustments to those commissions, and once our managers and business office approve those adjustments, what I really like is that there is an Adjustments tab where you can check that adjustments were made, therefore calculating the commissions I will be paid. What do you dislike about Performio?What I don't like about Performio is that after adjustments are made to commissions, the original commissions cannot be seen until after we get paid. I've learned to take a screenshot of these before they disappear! What problems is Performio solving and how is that benefiting you?Performio helps me solve the problem of wondering how much my commission payouts will be each month. This benefits me because I can budget my commission checks accordingly. ",
    "date": "2024-10-17T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Julie P."
  },
  {
    "title": "\"Commission Reviews and Tracking made easy!\"",
    "description": "What do you like best about Performio?Performio has been a game-changer in enabling visibility into commission payouts, quota attainment, and the data supporting these metrics. It empowers me with the insights needed to understand both revenue attainment and earnings. In my 15 years of enterprise sales experience, I can confidently say that it’s the most comprehensive commission tracking tool I’ve come across. What do you dislike about Performio?Performio is as good as it gets. However, its effectiveness is directly tied to how well it’s set up by the customer. The company I work for frequently makes acquisitions, and as a result, I sometimes find that new products sold aren’t listed in Performio, even though I’m paid on them. I’m not sure if this is a support issue or just something specific to the company I work for. What problems is Performio solving and how is that benefiting you?I use Performio to track my income and % Quota attainment based on new growth and renewals. ",
    "date": "2025-01-08T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Verified User in Information Technology and ServicesInformation"
  },
  {
    "title": "\"Performio works well even if you have many plan changes\"",
    "description": "What do you like best about Performio?What I liked the most was how easy it was to change a commission plan in the middle of the year to pay certain people differently based on what organizational changes might happen.  Adding new emplayee was easy and the ability to copy existing plans and then motify them to new employees was great. What do you dislike about Performio?Just be careful how you implement you biuld from the start.  If your data changes alot such as POS data, make sure you build in a locking previous paid.  Performio can do it.  You just have to keep it in mind. What problems is Performio solving and how is that benefiting you?We mainly use Performio for Sales Rep to have visibility into the data and how they were getting paid ",
    "date": "2024-12-17T00:00:00.000Z",
    "rating": 4,
    "reviewerName": "Ronald W."
  },
  {
    "title": "\"I am overall very happy\"",
    "description": "What do you like best about Performio?Using Performio has made managing my commissions and sales performance much easier in my car sales role. The platform simplifies everything from tracking sales to calculating commissions, letting me spend more time focusing on customers and less on paperwork.\n\nThe interface is straightforward, and it’s great how customizable the system is to fit the needs of my team. Although it’s pricier for smaller businesses, the time saved and the accuracy it brings to compensation management makes it well worth it for larger teams.\n\nFor anyone in car sales looking for a better way to manage commissions, I highly recommend Performio. What do you dislike about Performio?Performio has been a valuable tool for managing sales performance and commissions, but one thing I find a bit frustrating is the learning curve. While it’s powerful and offers a lot of customization, it can sometimes feel overwhelming, especially when you’re first getting started.\nThere are so many features and settings to explore, and it can take a bit of time to get everything dialed in just right. It’s not a huge issue once you get the hang of it, but it would be nice if the onboarding process was a little smoother, particularly for those who aren't as tech-savvy.\nThat said, once you’re comfortable with the system, it’s incredibly efficient and helpful. But if you’re new to it, expect a bit of a learning curve. What problems is Performio solving and how is that benefiting you?Performio has solved the headache of tracking sales performance and commissions manually. It automates complex calculations, ensuring accuracy and saving a lot of time. What used to take hours now happens in minutes, letting me focus more on sales. The transparency it provides also motivates the team by clearly showing performance. Overall, it’s made compensation management much more efficient and less prone to errors. ",
    "date": "2024-12-13T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Verified User in RetailInformation"
  },
  {
    "title": "\"Performio has been a great tool for my coworkers and I.\"",
    "description": "What do you like best about Performio?There's many things that I like about Performio!  \n1. Breaks out commission by client \n2. Organizes commission into different sale categories \n3. Easy to navigate \n4. Puts in my adjustments\n5. I can go back to previous months What do you dislike about Performio?I have had a great experience with Performio. The only thing I wish is that in the adjustment category, I wish I could see how much I make per adjustment instead of it being combined. What problems is Performio solving and how is that benefiting you?I can see how much I make per month/per client. It is allowing me to keep track on how much I make and how I am growing each account by month. ",
    "date": "2024-12-30T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Noelle M."
  },
  {
    "title": "\"Keepof track towards targets and goals\"",
    "description": "What do you like best about Performio?I love that Performio gives me both a detailed view of my team, and all teams as well as a snapshot of how we are tracking toward individual and combined goals. This makes it easy to see what's required of me and my teams across various metrics. I can also track performance against multiple goals and incentives. This is great for actionable feedback that can be tailored to individuals so as to best motivate them. What do you dislike about Performio?You do need to remember to check that you are in the right month in order to access attributes and reports. For example, quarterly bonus statements are only available if you are 'in' the month that the bonus is paid. Sometime you can forget to do this and this makes it confusing. What problems is Performio solving and how is that benefiting you?Performio helps me to put actionable goals in place against transparent measures. \nThis helps me to motivate stakeholders on an individual basis to encourage them by speaking their languange. ",
    "date": "2024-09-15T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Danielle C."
  },
  {
    "title": "\"Automating commission payments made easy\"",
    "description": "What do you like best about Performio?The platform works, even for a complex and complicated commissions process that we have. There are still a few manual workarounds that we have, but for the large part it works really well. It has taken each of our manager's commission review process from 3-4 hours a month down to 30 minutes or less. They have also been very responsive to fixes, questions, and after 'go-live' support. What do you dislike about Performio?There were a few things during implementation that we would have liked better automation around, that may have been unique to our business - most notably split commissions, that we were told no on. Also, while the system works I think it could be more visually pleasing. What problems is Performio solving and how is that benefiting you?paying, tracking, and managing sales commissions for individuals per month. ",
    "date": "2024-10-24T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Joe C."
  },
  {
    "title": "\"Love Using Performio!\"",
    "description": "What do you like best about Performio?Performio has a very user-friendly interface and I can navigate around and get to the info I need to see quickly.  It's quick, efficient, and I love that it stores my commissions back in time so that I can compare year over  year and month over month, etc.  I use it several times per month.  It integrates well with our other systems too. What do you dislike about Performio?There is nothing I would change about Performio. It's awesome as is. What problems is Performio solving and how is that benefiting you?Performio shows me immediately any of my upcoming chargebacks so that I can proactively work on them before payroll is submitted with my manager. ",
    "date": "2024-12-12T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Allison K."
  },
  {
    "title": "\"Performio guarantees uniform sales commissions\"",
    "description": "What do you like best about Performio?Performio has exceeded our expectations every time. I like it because it helps us with incentive and compensation management. Thanks to this platform we have consistently added value to our incentive management process, ensuring that we are measuring the right things and getting rewards. What do you dislike about Performio?I feel confident about the system because it has made a huge difference in the performance of our sellers. In all the time we have used this platform I have not had any problems, the whole team is delighted with the platform because it meets our needs. What problems is Performio solving and how is that benefiting you?We have managed to increase sales, monthly revenue and improve the visibility of the company. In addition, it has allowed us to dedicate part of our time to strategic planning since it gives our sellers transparency on what makes up their numbers so they can see every day what the have sold and what their monthly commission is. ",
    "date": "2024-08-25T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Jenni S."
  },
  {
    "title": "\"Best software to track team performance\"",
    "description": "What do you like best about Performio?Overall, I would say that a tool like Performio is a must for any type of company that has a sales team. Otherwise, a transparent process would not be possible. I like that it is a very intuitive and easy-to-use platform, very graphical and visual. I love being able to see how my teams are performing compared to all teams. What do you dislike about Performio?The overall experience with Performio is great! I'm glad that my company offers such a transparent and organized solution like Performio. I have nothing negative to say about this platform, in all the time we've used it I haven't had any problems. What problems is Performio solving and how is that benefiting you?I use it for sure about once a month to check my commissions, to see how I'm doing, and I also use it regularly to see how much income I'm going to make compared to my goal this month or this quarter. ",
    "date": "2024-08-31T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Pasquale P."
  },
  {
    "title": "\"Focused and precise numbers tell you what the scoreboard actually is for your business.\"",
    "description": "What do you like best about Performio?Being able to locate exact dates when commissions are paid is an advantage.  No more looking at a huge spreadsheet to locate your numbers.  The columns for set up are exact. What do you dislike about Performio?At times, the software times out.  If I want to keep my scoreboard up on my screen you need to adjust the settings depending on which OS you are using. What problems is Performio solving and how is that benefiting you?No more searching within your TMS to find out where you are in sales.  The system solves the headache of other numbers that are not relevant to your status. ",
    "date": "2024-12-13T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Jim G."
  },
  {
    "title": "\"Easy to use and read\"",
    "description": "What do you like best about Performio?It's easy to understand how I am tracking with my results as the month goes, and being able to have an easily accessible record of how have been doing in previous months. What do you dislike about Performio?Sometimes once a new day rolls over, the stats revert back to 0 until later on in the day. It can be frustrating when we need to wait until the middle of the day for the problem to resolve itself. It would be better if they stayed on the previous days results at least until they were updated, instead of reverting. What problems is Performio solving and how is that benefiting you?It helps me keep track of my sales progress so I can better keep on top of my KPIs. ",
    "date": "2024-10-22T00:00:00.000Z",
    "rating": 4,
    "reviewerName": "Dominic A."
  },
  {
    "title": "\"Sales performance management software for businesses\"",
    "description": "What do you like best about Performio?I like it mainly because of the ease of use and because it gives us up-to-date information which makes the program beneficial for everyone. Also, I like that it turns data into actionable information that we can use more easily for our reports. What do you dislike about Performio?I am glad that the company offers such a transparent and organized solution like Performio. I don't have any suggestions or negative things that I don't like. I consider it to have been a great asset since it was implemented here. What problems is Performio solving and how is that benefiting you?Performio takes the hassle and point out of automating the commission calculation process. It allows us to access previous months' totals easily and see if I'm hitting my targets. Plus, it helps us be more organized with our sales process and also, saves us a lot of time by not having to email or harass people for clarity on commissions. ",
    "date": "2024-08-15T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "David M."
  },
  {
    "title": "\"Collaborative & intelligent\"",
    "description": "What do you like best about Performio?I have a large team s it was helpful to see all my team members'  dashboard on one single page since it can display upto 100 entries. Further it remembered my last input & suggested the same which helped re-typing which would have otherwise been very cumbersome. Also allowing to export to excel or pdf helps to share it easily with standard office tools. Has improved visibility with a single pane & allowing real-time changes, with immediate updates to the team. What do you dislike about Performio?Do not really recollect of any drawbacks except aat times I faced a performance degradation maybe due to network delay or site traffic. Also a simple summary bifurcation or dashboard of the team (periodwise / functionwise) would really help. What problems is Performio solving and how is that benefiting you?Single window for defining performance parameters & tracking regularly; sharing it with others by generating excel or pdf reports. Realtime updation with immediate updates to team members. ",
    "date": "2024-10-18T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Verified User in Information Technology and ServicesInformation"
  },
  {
    "title": "\"Performio good software for transaction management and comissions\"",
    "description": "What do you like best about Performio?I love how I can track transition and be able to set different levels of commissions, like adding fees and a transsaction checklist. In addition to being a comprehensive software. In addition to being a comprehensive software, it is very to navigate and flexible between the different areas of the system and what I loved most is the tracking of production and sales associate commissions. What do you dislike about Performio?For now I have nothing in mind, everything is positive for my Performio is it delivers. What problems is Performio solving and how is that benefiting you?Overall I have enjoyed and benefited from Performio because it is wothwhile for sales performance managers and everything is positive, we can track, modify traffic and commissions and create and maintain more orderly and multiple transaction, it also help us a lot with reporting and it is definitely worth it. ",
    "date": "2024-09-02T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Soliyana B."
  },
  {
    "title": "\"Excellent way to validate sales information and trends\"",
    "description": "What do you like best about Performio?I think Performio is a great product that allows sales reps to review pay stubs, commissions, and meet their stated goals each month. I love the mobile app, its functionality has been great for checking in on reps who are close to meeting their montly or yearly goals when I'm not at my computer. What do you dislike about Performio?My overall experience with Performio has been positve, I have nothing negative to say about this platform. I has been much better than previous systems. I have never had any issues with the software, I have everything I need to achieve my goals. What problems is Performio solving and how is that benefiting you?We were looking for software that would allow the entire team to easily analyze our strengths and weaknesses, and Performio has made this possible through visual representations of our goals and actual performance. ",
    "date": "2024-08-28T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Cody S."
  },
  {
    "title": "\"Monthly commission made easy and in a single system with Performio\"",
    "description": "What do you like best about Performio?i like it because I can easily see the grapical representations of my goals set and achieved to date, they are very easy to understand. I also like that it gives me the ability to track my commission and that of my reps on a daily or weekly basis. What do you dislike about Performio?I like everything about Performio, I have nothing negative to say about this platform. I love that all the information provided in the system is very user-friendly and I can always find the information I need easily. What problems is Performio solving and how is that benefiting you?Before using Performio, as sales consultants we were looking for a software that would help us improved the accuracy of our reports, thanks to this platform we achieved this and we are very happy to see that the accuracy is constant. ",
    "date": "2024-09-02T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Fabrice C."
  },
  {
    "title": "\"Performio: the best platform for commission payments\"",
    "description": "What do you like best about Performio?I like this tool because it is easy to use, it provides visibility and transparency on commissions earned, it allows us to be organized and manage the company better. Also, I love the pie charts with their options because they make it very easy to see where I am. What do you dislike about Performio?I have nothing negative to say about performio. It helps me get unnecessary and tedious work done, allowing me to focus on other activities. Since I have been using this platform, commission payments are more punctual in the company. What problems is Performio solving and how is that benefiting you?Starting to use Performio as a performance management solution was one of our best decisions. It is a great tool that makes looking up payrolls extremely easy and a simple job. It allows us to have a better relationship of income and expenses within the company. ",
    "date": "2024-08-16T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Peter B."
  },
  {
    "title": "\"Performio allows you to track your goals every month\"",
    "description": "What do you like best about Performio?I like it because it's easy to digest on one screen. What I like most is that it has a system that performs the calculations automatically, allowing for no errors or subsequent calculations. It has drastically reduced the time it takes us to process payroll each month. What do you dislike about Performio?Performio is facused on providing customers with a great experience. Also, Performio's support is excellent and responds quickly when any issues arise. I have nothing negative to say about the platform, I'm happy so far. What problems is Performio solving and how is that benefiting you?Performio is an enterprise-grade software and mobile app that we use to manage and automate incentive compensatio with ease. It allows me to track my individual sales and verify that the payment is added up correctly. It also allows us to send a small edit copy to the manager or team director. ",
    "date": "2024-08-14T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Ben M."
  },
  {
    "title": "\"Performio perfect solution for performance management\"",
    "description": "What do you like best about Performio?I like that it has both on-server storage and cloud storage. I also like that it provides valuable information for potential buyers who are considering doing business with us. It also allows us to manage our commissions and earnings and better track our sales process. What do you dislike about Performio?Everyone in the sales department has loved how this platform works. Performio has adapted perfectly to our needs, I have nothing bad to say. Starting to use this tool has been the best decision. What problems is Performio solving and how is that benefiting you?It has allowed us to improve our sales commissions. It is the right software to boost the performance of the company's sales department. In addition, it has allowed us to automate the sales compensation process and helps us to have all our data organized and be prepared for any audit. ",
    "date": "2024-08-21T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Arancha P."
  },
  {
    "title": "\"Amazing tool to measure performance\"",
    "description": "What do you like best about Performio?I really like the dashboard and it not only measures my current performance but I am also able to see and compare past performances. Love the What if  feature is also helpful when trying to determine future performances. It is very user friendly and I use it several times a month. What do you dislike about Performio?I have not found anything I dislike the tool is very user friendly. What problems is Performio solving and how is that benefiting you?I am able to see all my KPI's in one tool, past and present. I definitely love playing around with the What If feature to calculate my future compensation. ",
    "date": "2024-10-21T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Carmen G."
  },
  {
    "title": "\"Excellent tool for analyzing planning and meeting objectives\"",
    "description": "What do you like best about Performio?The platform is a great options for alternative sales processes. I like how easy and simple it is to generate reports and reconcile our important data. It also provides the ability to track individual sales and up each payment correctly automatically. What do you dislike about Performio?I have not found any bugs or features that I do not consider positive about this tool. Our experience has been incredibly positive, thanks to performio, I can have all the calculations at my fingertips, my work is more productive and simpler. What problems is Performio solving and how is that benefiting you?Performio is a huge step up from using spreadsheets to manage compensation. It focuses on providing a great customer experience and has allowed us to cut down on the time it took process our payroll each month, allowing us to focus tha time on other tasks. ",
    "date": "2024-08-06T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Elise G."
  },
  {
    "title": "\"Performio is an excellent tool for tracking sales and calculating commissions\"",
    "description": "What do you like best about Performio?What I like most about Performio is that it shows quota achievement and quota tracking and allows transparency into what they are being paid and to see exactly how much they are earning in commissions and is very motivating. It allows for more transparency on how they are being paid and is easy to use and track. What do you dislike about Performio?Visually it needs improvement especially in the panel and in the visualizations that are more intuitive. What problems is Performio solving and how is that benefiting you?We keep track of monthly commissions and improve the calculations that were previosly incorrect. Now everything is excellent, providing data on quota and commission achievements, everything is in order and we can monitor our sales and make sure everything in accounted for the correct commission rate. ",
    "date": "2024-08-26T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Hussain A."
  },
  {
    "title": "\"Real-time sales forecasts are amazing.\"",
    "description": "What do you like best about Performio?Performio simplified the way I manage sales data for the better. One feature I appreciate the most is the way it allows easy validation of sales info with just a few clicks. That has been such a time-saver, especially during the times I switch between multiple sales regions. My dashboard's real-time sales forecasts have been a tremendous asset. I was able to monitor my ranking and the leaderboard was really motivating during last quarter’s push. Also, the clarity in commission percentages takes away any doubts, hence the whole process flows smoothly. What do you dislike about Performio?Desktop version is diverse compared to some limitations of the mobile version. There was a time when I was in a hurry and required more complex tools to be used, but had to switch to the desktop. What problems is Performio solving and how is that benefiting you?The major benefit for me was tracking my commission and payments. I don’t have the anxiety of missing any documents that might hold up the sales approval process. Performio makes sure that all documents are precise and no problems can appear, so I may look back at my payment history without any troubles. It ha reduced a lot of what was more manual work in the past. ",
    "date": "2024-09-08T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Danielle J."
  },
  {
    "title": "\"Simple and efficient way to manage commissions.\"",
    "description": "What do you like best about Performio?What I appreciate most about Performio is its simplicity and efficiency. Also, someone who takes the lead in managing commission reports, the ability to access pay stubs and track goals directly from the mobile app is my forte. I easily remember a time when I was away from the office and needed to check on a rep's progress - Performio did let me do that seamlessly. It's gratifying to have such a function at my fingertips, especially when you’re juggling multiple tasks. What do you dislike about Performio?There are really little complaints by me and my teammates. As opposed to our old system, which was clunky and tedious, Performio could be a breath of fresh air. I can hardly think of any significant problems that would make us unable to work together as a team. It's a steadfast partner and it has been exceedingly useful in the realization of our targets. What problems is Performio solving and how is that benefiting you?Performio has provided the solution to the main challenge we faced, which was the need for clear insights into our sales performance. With specific reference to visual dashboards, we have, in particular, a way of spotting trends, determining individual strengths, and improving areas. Together, it has given our team the transparency we needed to stay the course and foster accountability, thereby bearing the fruits of how we approached our goals. ",
    "date": "2024-09-07T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Philippe M."
  },
  {
    "title": "\"It is an excellent option in terms of alternative sales processes\"",
    "description": "What do you like best about Performio?I like it mainly for its compensation allocation feature, it is quite accurate and even automated. I also like that it has constant auditing features, as well as commission calculation features, which allow for no errors or subsequent calculations for client compensation. What do you dislike about Performio?I have not found any faults or any features that I do not consider positive about this tool. It has been excellent in helping us improve, advance our processes and achieve our goals. We can now be more efficient and faster in our work. What problems is Performio solving and how is that benefiting you?Before we learned about Performio, we were using a combination of home-grown systems that create a lot of work issues related to governance, disputes, and automation. ",
    "date": "2024-09-07T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Esther G."
  },
  {
    "title": "\"Sales dashboards always at hand!\"",
    "description": "What do you like best about Performio?I like that keeping track of sales data has never been simpler and less time-consuming than what I am experiencing nowadays. I used to avoid complex verifying processes because of the huge time involved in them. I think that performing sales only taken around handful of steps now can say that my essence of work is decided mostly by this system. The forecast feature of the Performio is mainly what I prayed for – a simple sight of estimation of performance indicates on the dashboard always enables me to reconfigure my plans or renew my strategy whether I am in the conference room or at home or a coffee shop. The leaderboard especially when our top sellers are highlighted is remarkable too, it brings up a competitive yet friendly sort of atmosphere among team members. What do you dislike about Performio?The tablet version of Performio is not as good as the desktop experience. I had situations where I needed to access more complex tools while on the go but was not able to do anything until I got back to my desk. What problems is Performio solving and how is that benefiting you?Performio is the answer to my pressing problems. Now, I can check my sales performance easily and get a real-time view of the sales needing approval due to absence of documents. The clarity in the commission percentage of the disputes and the compensation resolution center services have freed me from innumerable pains. Today’s software has greatly improved my work process so that I can spend more time in doing what I can bring revenue with- selling and selling! ",
    "date": "2024-09-04T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Franz D."
  },
  {
    "title": "\"Excellent and useful for managing everything related to commissions\"",
    "description": "What do you like best about Performio?I like the learning curve, which is solid, and the support team is very friendly. I think Performio provides a good overview of the trade-offs and is easy to use, which is what we needed. Also, the cost tracking is excellent, as is the flexibility to add or remove tasks, and how helpful it is that it automatically generates all the information we need. What do you dislike about Performio?It was a little difficult to implement but once achieved everything is excellent. What problems is Performio solving and how is that benefiting you?Once it was launched, we were able to improve the management of compensation and solidarity rewards and also improve everything related to sales, and with Performio we were able to achieve this, it is simply excellent. ",
    "date": "2024-09-02T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Rachel J."
  },
  {
    "title": "\"Sales Commission Compensation Excellence\"",
    "description": "What do you like best about Performio?Performio is a great tool that my Company uses to track/issue sales compensation commission for agents. What do you dislike about Performio?Sometimes the interface is not user friendly, specifically the fact that agents don't have a holistic dashboard to see all of their data at once. What problems is Performio solving and how is that benefiting you?Performio is performing all sales commission calculations and makes it so easy on the team to review. ",
    "date": "2024-12-20T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Kim A."
  },
  {
    "title": "\"Performio is fantastic for tracking my monthly commissions and strive for excellence\"",
    "description": "What do you like best about Performio?The accurate reporting around commision made off of every merchant and their transactions tracked, Seeing the exact amount I made for the month beforehand, accurate progress/target ratio helping you quickly understand how close you are to target during your current time period. What do you dislike about Performio?More accurate reporting around the commision broken up on a daily basis so I can have data around high and low transaction times. I would also like the see progress/target forecasts from the start of your target time frame and until the end. What problems is Performio solving and how is that benefiting you?Seeing what I had made the month prior in commision and being able to manually forecast how far I am from target. I also love seeing the breakdown on a merchant level of transactions, COGS, GST, and any other deuctions so I can understand that. ",
    "date": "2024-07-26T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "billy s."
  },
  {
    "title": "\"An easy-to-view commission product with a good display panel\"",
    "description": "What do you like best about Performio?I like the dashboard because it is easy to read the information and provides multiple perspectives on my performance and that of the team. Moreover, the commissions are easy to see and the information is well organized and easy to focus on, which is nice. What do you dislike about Performio?The platform is well built, however it does not have enough functions and it is a bit difficult to understand the information. What problems is Performio solving and how is that benefiting you?It solves a lot of problems for us, especially with compensatory sales, we already had a clear view of commissions and the performance has improved a lot, many errors have been corrected and it has become a solid tool that helps us a lot, being a facilitator of commission payments, so we are happy with Performio. ",
    "date": "2024-08-07T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Lamriben N."
  },
  {
    "title": "\"Performio Review\"",
    "description": "What do you like best about Performio?Performio is a powerful sales performance management platform that has significantly streamlined our commission tracking and reporting processes What do you dislike about Performio?Learning Curve\nPricing: For smaller businesses, Performio can be on the pricier side.\nIntegration: While Performio integrates with various systems, there can be some limitations depending on your existing software stack. What problems is Performio solving and how is that benefiting you?User-Friendly Interface\nCustomization: One of Performio's standout features is its high level of customization.\nautomated commission calculations have reduced errors and saved us countless hours of manual work. This feature alone has improved our efficiency dramatically. ",
    "date": "2024-10-23T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Arun Kumar  A."
  },
  {
    "title": "\"Great tool with extreme level of flexibility for business specific customization\"",
    "description": "What do you like best about Performio?The flexibility of the software to adapt to almost all cases. Competitive pricing. Great support team and response time to tickets What do you dislike about Performio?The backend is hard to understand at first as an administrator. What problems is Performio solving and how is that benefiting you?Allowing sales reps to view compensation and quota attainment in one place as well as allow people managers to view their direct reports commissions/performance ",
    "date": "2024-12-19T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Siddharth S."
  },
  {
    "title": "\"Sales compensation made easy with Performio\"",
    "description": "What do you like best about Performio?I like being able to easily export the settled payments and get the necessary information, and we can calculate the commissions in real time, which saves a lot of time. On the other hand, it is excellent to be able to analyze in depth the earnings and the support team is excellent, and finally, its interface is good. What do you dislike about Performio?It is easy to use and everything works perfectly. Neither I nor any of our colleagues have had any complaints. What problems is Performio solving and how is that benefiting you?Performio does an unparalleled job. Today we can benefit from tracking revenue, sales, compensation, pulling data from spreadsheets and easy-to-calculate compensation plans and getting good end-to-end visibility for our team. ",
    "date": "2024-09-04T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Roanne S."
  },
  {
    "title": "\"He is very clear and updates me regularly\"",
    "description": "What do you like best about Performio?It's really the most simple and straightforward tool I've used so far! And its clear and simple user interface is exactly what I expected from this platform. Performio has made tracking my commissions fun and easy. And I love the automation and reliability of this tool. What do you dislike about Performio?Y REALLY enjoy the platform. I have seen no downsides to using Performio. It helps me track my operating expenses and do proactive financial planning. Overall, I really enjoy Perfomio and have nothing bad to say. What problems is Performio solving and how is that benefiting you?Performio updates the information daily and gives you a commission forecast. In a soles role, it's very handy to always have your monthly bonuses in view. I also love that it shows me what to expect for my commission in real time. ",
    "date": "2024-08-01T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Jihed J."
  },
  {
    "title": "\"Use Performio for better commission management\"",
    "description": "What do you like best about Performio?I like it because it allows me to carry out the compensation process for out sales in an automated way. It has a no-code architecture that is perfect for use by users without prior experience. Also, I love the incentive strategy, because it is quite aguile. What do you dislike about Performio?Excellent Software as a Service (SAAS). Performio is always right and they make sure my salary is the right amount. I have no complaints about this platform, it fits the company's needs very well. What problems is Performio solving and how is that benefiting you?I use it primarily as an incentive compensation management provider. We also use it to easily and simply monitor sales for the month. Additionally, Performio has improved the transparency of commission records, our managers are now more agile and efficient. ",
    "date": "2024-08-09T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Tobias K."
  },
  {
    "title": "\"Not the worst but not the best\"",
    "description": "What do you like best about Performio?That the data is easy to understand and easy to view What do you dislike about Performio?Long time to load data, often not updated or showing zeros. It doesn't intergrate well into much of our reporting and we need to create additional reports by hand to make the data useful to be implemented. There is seemingly no customer support, and the rating question comes up multiple times a day no matter how many times you say no. What problems is Performio solving and how is that benefiting you?I can see my commission and sales targets to set goals. ",
    "date": "2024-10-23T00:00:00.000Z",
    "rating": 1.5,
    "reviewerName": "Sarah-Jane K."
  },
  {
    "title": "\"Excellent for transparency and visibility\"",
    "description": "What do you like best about Performio?I love the clear and uncluttered platform, it shows exactly what I'm making in the different categories. It's really helpful to understand the breakdown of commissions throughout the month. I like the color charts that make it really easy to use. What do you dislike about Performio?I sometimes have a hard time keeping track of how much I will earn at the end of the month. I wish I could just go straight to the opportunity won. Sometimes it makes a while for the numbers to update. What problems is Performio solving and how is that benefiting you?It makes it easy to see where you stand based on your metrics. It's very easy to understand how the platform works. It allows me to easily track my transactions and provides perfect reports on my sales. ",
    "date": "2024-08-10T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Kai O."
  },
  {
    "title": "\"The visual part of the visualization is very nice and easy to understand, all at a glance\"",
    "description": "What do you like best about Performio?I really like that it allows me to report issues I have with my pay. It also allows us to clearly organize our compensation plans and calculate payouts in a way that makes audits easy. What do you dislike about Performio?I think I have connectivity issues, but I'm not sure ir it's my internet, or the tool. I would also like the data to be downloaded in PDF format. What problems is Performio solving and how is that benefiting you?The ability to send reports directly to sales reps is extremely helpful. There are also reporting and statement features which are great for end users. The breakdown of payments by section is also very helpful and makes everything easy to read and navigate. ",
    "date": "2024-09-03T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Chakib E."
  },
  {
    "title": "\"Performio is excellent for compensation analysis and goal tracking\"",
    "description": "What do you like best about Performio?I like Performio because it is an effective tool for tracking our individual goals and progress. In addition, the experience is positive because of its clean and phenomenal interface. I also like the transparency and ease of understanding because so much can be accomplished with a few clicks. What do you dislike about Performio?Not much to say for now, I just wish they would improve the syncronization and real time update of commission numbers. What problems is Performio solving and how is that benefiting you?Many problems solved and good benefits gained with Performio, especially the way it helps to track payments and it is a breakthrough because of its easy administration, use of spreadsheets and all without any glitches, it always works great for sales, compensation and legacy commissions, everything is on track. ",
    "date": "2024-08-12T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Fabio F."
  },
  {
    "title": "\"Works great - easy to use and understand\"",
    "description": "What do you like best about Performio?The ease of use. It is a very user friendly product. We all use this product frequently and there are rarely any questions. What do you dislike about Performio?Sometimes the breakdown of pay for each month can be a little confusing. Maybe making a simplier month to month performance pay breakdown. What problems is Performio solving and how is that benefiting you?How much we get paid for meetings and opportunities. ",
    "date": "2024-12-17T00:00:00.000Z",
    "rating": 4.5,
    "reviewerName": "Monica B."
  },
  {
    "title": "\"Excellent support system.  This is easy to use and very precise.  Like riding a bike after first use\"",
    "description": "What do you like best about Performio?I've been in my industry close to 35 years.  This sure beats figuring out commissions by hand.  This is precise, easy to operate and very accurate.  When mistakes are made or overrides are needed, everything is recorded, easily edited and every key stroke is recorded. What do you dislike about Performio?Not much to dislike.  I like everything about it.  Could use a mobile option that is easy to navigate. What problems is Performio solving and how is that benefiting you?this program just makes it easy to calculate compensation to my team, track adjustments to their sales performance and dispute charge-backs. ",
    "date": "2024-10-17T00:00:00.000Z",
    "rating": 5,
    "reviewerName": "Nicanor B."
  }
]